config/emacs/mine/editor-config.org
#+TITLE: Balamah's emacs config
#+AUTHOR: Miha Balandin

If you don't like some functional, configure =src/local.el=

* Table of contents :toc:
- [[#loader][Loader]]
- [[#functions][Functions]]
  - [[#get-keybinding-using-prefix][Get keybinding using prefix]]
  - [[#bind][Bind]]
  - [[#get-only-file-name][Get only file name]]
  - [[#read-file][Read file]]
  - [[#copy-string-to-clipboard][Copy string to clipboard]]
  - [[#read-conf-variable][Read conf variable]]
  - [[#macro-execute-depending-on-settingsconf-variables][Macro: execute depending on settings.conf variables]]
  - [[#macro-execute-depending-on-os][Macro: execute depending on os]]
  - [[#edit-crontab][Edit crontab]]
  - [[#remove-prefix-to-first-space][Remove prefix to first space]]
  - [[#run-function-from-shell-file][Run function from shell file]]
  - [[#get-org-mode-variable][Get org-mode variable]]
- [[#standart-settings][Standart settings]]
  - [[#appearance][Appearance]]
  - [[#settings][Settings]]
  - [[#keybindings][Keybindings]]
  - [[#comfy-keybindings][Comfy keybindings]]
  - [[#disabling][Disabling]]
- [[#plugins][Plugins]]
  - [[#plugin-managers-configuration][Plugin managers configuration]]
  - [[#evil-mode][Evil mode]]
  - [[#dependency-plugins][Dependency plugins]]
  - [[#fuzzy-finding][Fuzzy finding]]
  - [[#better-help-pages][Better help pages]]
  - [[#autopairs][Autopairs]]
  - [[#org-mode][Org mode]]
  - [[#additional-org-mode-plugins][Additional org mode plugins]]
  - [[#org-mode-presentations][Org mode presentations]]
  - [[#rainbow][Rainbow]]
  - [[#ui-stuff][Ui stuff]]
  - [[#dashboard][Dashboard]]
  - [[#keycast][Keycast]]
  - [[#monkeytype][Monkeytype]]
  - [[#string-cases-cycle][String cases cycle]]
  - [[#emacs-everywhere][Emacs everywhere]]
  - [[#projects][Projects]]
  - [[#transpose-frame][Transpose frame]]
  - [[#dired][Dired]]
  - [[#which-key][Which key]]
  - [[#python-venv-support][Python venv support]]
  - [[#drag-stuff][Drag stuff]]
  - [[#important-major-modes][Important major modes]]
  - [[#gradle][Gradle]]
  - [[#holyc-mode][Holyc mode]]
  - [[#project-todos][Project TODOs]]
  - [[#yasnippet][Yasnippet]]
  - [[#magit][Magit]]
  - [[#docker][Docker]]
  - [[#lsp-mode][Lsp mode]]
  - [[#company-mode][Company mode]]
  - [[#debug][Debug]]
  - [[#vterm][Vterm]]
  - [[#nyan-cat-mode][Nyan cat mode]]
  - [[#sudo-edit][Sudo edit]]
  - [[#sessions-saving][Sessions saving]]
  - [[#coding-ligatures][Coding ligatures]]
- [[#custom-functional][Custom functional]]
  - [[#git-sync][Git sync]]
  - [[#project-config][Project config]]
  - [[#reader-mode][Reader mode]]
  - [[#open-bookmarks][Open bookmarks]]
  - [[#bookmark-major-mode][Bookmark major-mode]]
  - [[#org-mode-discipline][Org-mode discipline]]

* Loader
:properties:
:header-args: :tangle ~/.config/emacs/mine/loader.el
:end:

The file loads emacs config parts. If you want to turn emacs into
window manager, change =profile= to =exwm= in [[file:~/.files-balamah/settings.conf][settings.conf]]

You can see org-mode config of exwm [[file:~/.config/emacs/mine/window-manager.org][here]]
#+begin_src elisp
(dolist (file '("~/.config/emacs/mine/src/functions.el"
				"~/.config/emacs/mine/src/standart-stuff.el"
				"~/.config/emacs/mine/src/plugins.el"
				"~/.config/emacs/mine/src/custom-functional.el"
				"~/.config/emacs/mine/src/local.el"
				))
  (load file))

(with-system '(gnu/linux gnu/kfreebsd)
  (with-conf-variable "profile" "exwm"
	(load "~/.config/emacs/mine/src/exwm.el")))

(let ((temporary-configuration "/tmp/.files-balamah/temporary-config.el"))
  (when (file-exists-p temporary-configuration)
	(load temporary-configuration)))
#+end_src

* Functions
:properties:
:header-args: :tangle ~/.config/emacs/mine/src/functions.el
:end:

** Get keybinding using prefix
#+begin_src elisp
(defun pkbd (prefix keychord)
  "Get keybinding using prefix.
Useful when you make your functional and the functional has its prefix.
It is not very convenient to always create keybindings with the same prefix like
(kbd (concat prefix \" \" keychord)).
It is much better to just use
(pkbd prefix keychord)
"
  (kbd (concat prefix " " keychord)))
#+end_src

** Bind
The standart function doesn't look beautiful really for you sometimes
need to call it many times to bind multiple functions

#+begin_src elisp
(defun global-bind (keybindings-alist &optional prefix)
  "Bind commands to keybindings sometimes using prefix.
Usage is here:
(global-bind '(
    (\"C-c j f\" . function-call)
    (\"C-c j o\" . otherfunction-call)))

If you want to create prefix keybindings, you need to set prefix to
some prefix, like C-c S, which will look like
(global-bind '(
    (\"f\" . function-call)
    (\"o\" . otherfunction-call)) \"C-c j\")
"

  (dolist (alist keybindings-alist)
	(if prefix
		(global-set-key (pkbd prefix (car alist)) (cdr alist))
	  (global-set-key (kbd (car alist)) (cdr alist)))))

(defun map-bind (keybindings-alist keymap &optional prefix)
  "Bind commands to keybindings for keymap sometimes using prefix.
Usage is here:
(map-bind '((\"C-c j f\" . function-call)
            (\"C-c j o\" . otherfunction-call)) php-mode-map)

If you want to create prefix keybindings, you need to set prefix to
some prefix, like C-c S, which will look like
(map-bind '((\"f\" . function-call)
            (\"o\" . otherfunction-call)) php-mode-map \"C-c j\")
"

  (dolist (alist keybindings-alist)
	(if prefix
		(define-key keymap (pkbd prefix (car alist)) (cdr alist))
	  (define-key keymap (kbd (car alist)) (cdr alist)))))
#+end_src

** Get only file name
It needs parameter: =buffer-file-name=

#+begin_src elisp
(defun get-only-file-name (file-path)
  "file-path can be buffer-file-name"
  (interactive)
  (file-name-nondirectory file-path))
#+end_src

** Read file
#+begin_src elisp
(defun read-file (filename)
  "Return string that is readen from FILENAME"
  (with-temp-buffer
	(insert-file-contents filename)
	(buffer-string)))
#+end_src

** Copy string to clipboard
#+begin_src elisp
(defun copy-string-to-clipboard (string)
  "Copy string to the clipboard"
  (when string
    (kill-new string)
    (message "Copied to clipboard: %s" string)))
#+end_src

** Read conf variable
#+begin_src elisp
(defun read-conf-variable (file variable-name)
  "Read the value of VARIABLE-NAME from FILE with format key=value"
  (with-temp-buffer
    (insert-file-contents file)
    (goto-char (point-min))
    (let ((regex (format "^%s[ \t]*=[ \t]*\\(.*\\)$" (regexp-quote variable-name)))
          value)
      (while (re-search-forward regex nil t)
        (setq value (string-trim (match-string 1))))
      value)))
#+end_src

** Macro: execute depending on settings.conf variables
#+begin_src elisp
(defmacro with-conf-variable (variable value &rest body)
  "Execute depending on variable which should be equal to value.
Usage:
(with-conf-variable \"profile\" \"no-wm\"
  (set-frame-parameter nil 'alpha-background 93))"

  (declare (indent defun))
  `(when (equal
		  (read-conf-variable "~/.files-balamah/settings.conf" ,variable) ,value)
	 ,@body))

(defmacro unless-conf-variable (variable value &rest body)
  "Execute depending on variable which should NOT be equal to value.
Usage:
(unless-conf-variable \"profile\" \"no-wm\"
  (set-frame-parameter nil 'alpha-background 93))"

  (declare (indent defun))
  `(unless (equal
		  (read-conf-variable "~/.files-balamah/settings.conf" ,variable) ,value)
	 ,@body))

(defmacro if-conf-variable (variable value then else)
  "Execute depending on variable. If condition is t, then it will
execute first code block, otherwise it will execute second.
Just like 'if' in elisp"

  (declare (indent defun))
  `(if (equal
		(read-conf-variable "~/.files-balamah/settings.conf" ,variable) ,value)
	   ,then
	 ,else))
#+end_src

** Macro: execute depending on os
#+begin_src elisp
(defmacro with-system (types &rest body)
  "Execute code if system-type is one of systems in list.
It should look like
(with-system '(gnu/kfreebsd gnu/linux)
  (some-code-here))
"
  (declare (indent defun))
  `(when (member system-type ,types)
     ,@body))

(defmacro with-not-system (types &rest body)
  "Execute code if system-type is not from types list.
It should look like
(with-not-system '(darwin windows-nt)
  (some-code-here)
  (it-wont-execute-on-darwin-and-windows-nt))
"
  (declare (indent defun))
  `(when (not (member system-type ,types))
     ,@body))
#+end_src

** Edit crontab
#+begin_src elisp
(defun crontab-edit ()
  "Open crontab -e in emacs buffer"
  (interactive)
  (with-editor-async-shell-command "crontab -e"))
#+end_src

** Remove prefix to first space
#+begin_src elisp
(defun remove-prefix-to-first-space (str)
  "Remove everything before and including the first space in the string"
  (replace-regexp-in-string "^.*?\\s-+" "" str))
#+end_src

** Run function from shell file
#+begin_src elisp
(defun source-shell-script-run-command (shell-config-file command)
  "Source the shell script and run the command in the same shell process"
  (let ((script (concat "source " shell-config-file " && " command)))
    (shell-command-to-string script)))
#+end_src

** Get org-mode variable
#+begin_src elisp
(defun org-get-keyword-variable-value (key)
  "Get value from org-mode header"
  (let ((parsed (org-element-parse-buffer)))
    (org-element-map parsed 'keyword
      (lambda (el)
        (when (string-equal (org-element-property :key el) key)
          (org-element-property :value el)))
      nil t)))
#+end_src

* Standart settings
:properties:
:header-args: :tangle ~/.config/emacs/mine/src/standart-stuff.el
:end:

Here is configuration for default stuff

** Appearance
*** Set tranparency
#+begin_src elisp
(with-system '(gnu/kfreebsd gnu/linux)
  (unless-conf-variable "colorscheme" "pywal"
	(set-frame-parameter nil 'alpha-background 100)
	(add-to-list 'default-frame-alist '(alpha-background . 100)))

  (with-conf-variable "colorscheme" "pywal"
	(set-frame-parameter nil 'alpha-background 93)
	(add-to-list 'default-frame-alist '(alpha-background . 93))))
#+end_src

*** Change font
#+begin_src elisp
(defvar emacs-font-free "JetBrains Mono NFM-13"
  "Emacs font on free systems")

(defvar emacs-font-nt "JetBrainsMono NF-13"
  "Emacs font on nt systems")

(with-system '(gnu/kfreebsd gnu/linux)
  (add-to-list 'default-frame-alist `(font . ,emacs-font-free)))

(with-system '(windows-nt)
  (add-to-list 'default-frame-alist `(font . ,emacs-font-nt)))
#+end_src

