config/emacs/mine/src/standart-stuff.el
(with-system '(gnu/kfreebsd gnu/linux)
  (unless-conf-variable "colorscheme" "pywal"
	(set-frame-parameter nil 'alpha-background 100)
	(add-to-list 'default-frame-alist '(alpha-background . 100)))

  (with-conf-variable "colorscheme" "pywal"
	(set-frame-parameter nil 'alpha-background 93)
	(add-to-list 'default-frame-alist '(alpha-background . 93))))

(defvar emacs-font-free "JetBrains Mono NFM-13"
  "Emacs font on free systems")

(defvar emacs-font-nt "JetBrainsMono NF-13"
  "Emacs font on nt systems")

(with-system '(gnu/kfreebsd gnu/linux)
  (add-to-list 'default-frame-alist `(font . ,emacs-font-free)))

(with-system '(windows-nt)
  (add-to-list 'default-frame-alist `(font . ,emacs-font-nt)))
