config/emacs/mine/editor-config.org
** Settings
*** Configure tabs
Tabwidth is 4 spaces. Looks beautiful
#+begin_src elisp
(setq-default tab-width 4)
#+end_src

*** Change window title
If system is gnu/linux or gnu/kfreebsd, and profile is not no-wm, it
will look like " file name - GNU emacs". But if os is different that
these, the title will look like "* file name - GNU emacs"
#+begin_src elisp
(with-system '(gnu/linux gnu/kfreebsd)
  (unless-conf-variable "profile" "no-wm"
	(setq frame-title-format
		  '((:eval (if (buffer-modified-p) " "))
			(:eval (if (buffer-file-name)
					   (abbreviate-file-name (buffer-file-name)) "%b"))
			" - GNU emacs"))))

(with-system '(windows-nt darwin haiku cygwin)
  (setq frame-title-format
		'((:eval (if (buffer-modified-p) "* "))
		  (:eval (if (buffer-file-name)
					 (abbreviate-file-name (buffer-file-name)) "%b"))
		  " - GNU emacs")))
#+end_src

*** Enable line numbers
Set to visual because relative line numbers suck in emacs with
org-mode. When you fold headlines, it will show relative number
from this line to folded, which sucks. Now it shows only visually

#+begin_src elisp
(setq display-line-numbers-type 'visual
	  display-line-numbers-current-absolute t
	  display-line-numbers-width 4 
	  display-line-numbers-widen t)

(global-display-line-numbers-mode) 
#+end_src

*** Scratch buffer
It changes mode to org-mode and it changes inital message
#+begin_src elisp
(setq initial-major-mode 'org-mode
      initial-scratch-message "#+TITLE: Scratch buffer
,#+LATEX_HEADER: \\usepackage[english,ukrainian]{babel}
,#+LATEX_HEADER: \\usepackage{mhchem}

")
#+end_src

*** Change backup directory
*~ files in directory look ugly

#+begin_src elisp
(setq backup-directory-alist '((".*" . "~/.config/emacs/mine/backups")))
#+end_src

*** Kill buffer without asking
It's annoying when i want to kill vterm

#+begin_src elisp
(setq kill-buffer-query-functions nil)
#+end_src

*** ERC
ERC is a powerful, modular, and extensible Internet Relay Chat client

#+begin_src elisp
(setq erc-join-buffer 'buffer)

(global-set-key (kbd "C-c e") 'erc-tls)
#+end_src

*** Delete dumbass warnings
Sometimes warnings can be really annoying, therefore it is better to
disable them. They can be disabled by setting to =no= =$emacsEnableWarnings=

#+begin_src elisp
(with-conf-variable "emacsEnableWarnings" "no"
  (setq warning-minimum-level :error))
#+end_src

*** Change encoding to utf-8
#+begin_src elisp
(setq org-export-coding-system 'utf-8
	  coding-system-for-read 'utf-8-unix
	  coding-system-for-write 'utf-8-unix)
#+end_src

*** Show column number on modeline
#+begin_src elisp
(setq column-number-mode t)
#+end_src

*** Enable which key tips
The 'which-key' package from GNU ELPA is now included in Emacs.  It
implements the global minor mode 'which-key-mode' that displays a
table of key bindings upon entering a partial key chord and waiting
for a moment.  For example, after enabling the minor mode, if you
enter 'C-x' and wait for one second, the minibuffer will expand with
all available key bindings that follow 'C-x' (or as many as space
allows).

#+begin_src elisp
(with-conf-variable "emacsEnableOldVersionConfig" "no"
  (which-key-mode))
#+end_src

** Keybindings
*** Toggle strings hyphenation
Without hyphenation reading bible in org-mode is painful

#+begin_src elisp
(defun truncate-lines-hook ()
  (setq truncate-lines nil))

;; (add-hook 'org-mode-hook #'truncate-lines-hook)

(defun truncate-lines-toggle ()
  (interactive)
  (setq-local truncate-lines (not truncate-lines))
  (message "truncate-lines has changed to %s" truncate-lines))

(global-set-key (kbd "C-c h") 'truncate-lines-toggle)
#+end_src

*** Change transparency on fly
#+begin_src elisp
(defun change-transparency (level)
  "Prompt for a transparency level and apply it to all frames"
  (interactive
   (list
    (string-to-number (read-string "Enter transparency level (0 - 100) >>> ")))
   )
  (dolist (frame (frame-list))
    (set-frame-parameter frame 'alpha-background level))
  (setq default-frame-alist (assq-delete-all 'alpha-background default-frame-alist))
  (add-to-list 'default-frame-alist (cons 'alpha-background level)))

(global-set-key (kbd "C-c g") 'change-transparency)
#+end_src

*** Window resize
It's very annoying to touch the mouse, it's cooler to use only keyboard

**** Define resize functions
Standart function for resizing windows suck, for they do it very slow

#+begin_src elisp
(defun improved-enlarge-window-horizontally ()
  (interactive)
  (enlarge-window-horizontally 5))

(defun improved-shrink-window-horizontally ()
  (interactive)
  (shrink-window-horizontally 5))

(defun improved-enlarge-window ()
  (interactive)
  (enlarge-window 3))

(defun improved-shrink-window ()
  (interactive)
  (shrink-window 3))
#+end_src

**** Functions binding
#+begin_src elisp
(global-bind '(("C-&" . improved-enlarge-window-horizontally)
			   ("C-*" . improved-shrink-window-horizontally)
			   ("C-M-&" . improved-shrink-window)
			   ("C-M-*" . improved-enlarge-window)))
#+end_src

*** Close window and kill buffer
Very useful for vterm when you run the file

#+begin_src elisp
(defun kill-buffer-close-window ()
  (interactive)
  (kill-buffer)
  (delete-window))

(global-set-key (kbd "C-x c") 'kill-buffer-close-window)
#+end_src

*** Package manager
It's not very comfortable to always press =M-x= and run command with
^package. It looks much cooler to install package using keybindings

#+begin_src elisp
(global-bind '(("i" . package-install)
			   ("d" . package-delete)
			   ("l" . package-list-packages)) "C-c P")
#+end_src

*** Toggle line numbers
#+begin_src elisp
(global-set-key (kbd "C-S-n") 'display-line-numbers-mode)
#+end_src

*** Eval buffer
#+begin_src elisp
(global-set-key (kbd "C-c C-<return>") 'eval-buffer)
#+end_src

*** Restart emacs
I'm annoyed to always run =M-x= *restart-emacs*

#+begin_src elisp
(defun restart-emacs-ask ()
  (interactive)
  (when (y-or-n-p "Are you sure to restart emacs?")
	(restart-emacs)))

(global-set-key (kbd "C-c R") 'restart-emacs-ask)
#+end_src

*** Make directory
I want to use cool method to create directories

#+begin_src elisp
(global-set-key (kbd "C-c m m") 'make-directory)
#+end_src

Create directory and cd
#+begin_src elisp
(defun make-directory-dired (directory)
  "Make directory DIRECTORY and open in dired"
  (interactive
   (list (read-file-name "Make directory and open in dired: "
						 default-directory default-directory nil nil)))
  (make-directory directory)
  (dired directory))

(global-set-key (kbd "C-c m d") 'make-directory-dired)
#+end_src

*** Toggle line truncate
#+begin_src elisp
(defun truncate-toggle ()
  (interactive)
  (setq truncate-lines (not truncate-lines)))

(global-set-key (kbd "C-c q") 'truncate-toggle)
#+end_src

*** Scroll using keybindings
={}= are like =jk= in vim motions

| Key | Direction | Analog in vim motions |
|-----+-----------+-----------------------|
| {   | down      | j                     |
| }   | up        | k                     |

#+begin_src elisp
(defun scroll-up-like-mwheel ()
  (interactive)
  (scroll-down-command 1))

(defun scroll-down-like-mwheel ()
  (interactive)
  (scroll-up-command 1))

(global-bind '(("C-M-}" . scroll-up-like-mwheel)
			   ("C-M-{" . scroll-down-like-mwheel)))
#+end_src

*** Reload emacs config
#+begin_src elisp
(defun emacs-reload-config ()
  "Load config from ~/.config/emacs/mine/init.el"
  (interactive)
  (load-file "~/.config/emacs/mine/init.el"))

(global-set-key (kbd "C-x R") 'emacs-reload-config)
#+end_src

*** Increase LaTeX preview scale
#+begin_src elisp
(defun org-latex-preview-scale-change (scale)
  "Change scale of LaTeX previews"
  (interactive
   (list
	(read-number "Pick LaTeX preview scale (1.5 is normal) >>> ")))
  (setq org-format-latex-options
		(plist-put org-format-latex-options :scale scale))
  (message "LaTeX preview scale was changed to %s" scale))

(with-eval-after-load 'org
  (define-key org-mode-map (kbd "C-c C-x S") 'org-latex-preview-scale-change))
#+end_src

*** Align regexp
#+begin_src elisp
(global-set-key (kbd "C-c a") 'align-regexp)
#+end_src

** Comfy keybindings
Standart emacs keybindings very painful and slow. It's better
to not unhold ctrl

*** Window control
#+begin_src elisp
(global-bind '(("C-4 C-f" . find-file-other-window)
			   ("C-1" . delete-other-windows)
			   ("C-o" . other-window)) "C-x")
#+end_src

*** C-x o backward
#+begin_src elisp
(defun other-window-backward ()
  (interactive)
  (other-window -1))

(global-set-key (kbd "C-x C-S-o") 'other-window-backward)
#+end_src

*** Open scratch buffer
#+begin_src elisp
(global-set-key (kbd "C-c s") 'scratch-buffer)
#+end_src

*** Find text in project
#+begin_src elisp
(global-set-key (kbd "C-S-F") 'find-grep-dired)
#+end_src

*** Split keybindings
Split and switch window
#+begin_src elisp
(defun split-below-switch-window (&optional no-redisplay)
  (interactive)
  (split-window-below)

  (unless no-redisplay
	(redisplay))

  (other-window 1))

(defun split-right-switch-window (&optional no-redisplay)
  (interactive)
  (split-window-right)

  (unless no-redisplay
	(redisplay))

  (other-window 1))

(global-bind '(("C-2" . split-below-switch-window)
			   ("C-3" . split-right-switch-window)) "C-x")
#+end_src

Split and run M-x
#+begin_src elisp
(defun mx ()
  (interactive)
  (call-interactively 'execute-extended-command))

(defun split-below-mx ()
  (interactive)
  (split-below-switch-window)
  (mx))

(defun split-right-mx ()
  (interactive)
  (split-right-switch-window)
  (mx))

(global-bind '(("C-#" . split-right-mx)
			   ("#"   . split-right-mx)
			   ("C-@" . split-below-mx)
			   ("@"   . split-below-mx)) "C-x")
#+end_src

List buffers and switch window
#+begin_src elisp
(defun list-buffers-other-window ()
  (interactive)
  (list-buffers)
  (other-window 1))

(global-set-key (kbd "C-x C-b") 'list-buffers-other-window)
#+end_src

