config/emacs/mine/editor-config.org
*** Copy buffer name
#+begin_src elisp
(defun copy-buffer-name ()
  (interactive)
  (kill-new buffer-file-name)
  (message "`%s' copied to clipboard" (buffer-file-name)))

(global-set-key (kbd "C-c {") 'copy-buffer-name)
#+end_src

*** Tabs
Default tab keybindings suck, therefore it is better to make them more
intuitive. Prefix is =C-x T=

#+begin_src elisp
(global-bind '(("n" . tab-new)
			   ("c" . tab-close)
			   ("C" . tab-close-other)
			   ("b" . switch-to-buffer-other-tab)
			   ("f" . find-file-other-tab)
			   ("d" . dired-other-tab)
			   ("s" . tab-switch)
			   ("r" . tab-rename)
			   ("o" . other-tab-prefix)) "C-x T")
#+end_src

** Disabling
*** Ui elements
I just don't need them, because i use keybindings
#+begin_src elisp
(unless-conf-variable "profile" "macos"
  (menu-bar-mode -1)
  )

(tool-bar-mode -1)
(scroll-bar-mode -1)
#+end_src

*** Prompt for following link
All the time it asks to open file that is link, which sucks
#+begin_src elisp
(setq vc-follow-symlinks t)
#+end_src

*** Keybindings for freezing
Unbind keybindings for freezing. I just don't know how to unfreeze, i
searched for it i didn't find anything(((
#+begin_src elisp
(dolist (keybinding '("C-z" "C-x C-z"))
  (global-unset-key (kbd keybinding)))
#+end_src

*** Tetris
I got addicted to tetris, and i may be distracted with it a lot,
therefore i need to disable for a bit

#+begin_src elisp
(with-conf-variable "emacsEnableTetris" "no"
  (defun tetris ()
	"Print message to not play tetris"
	(interactive)
	(message "Don't play in it now. Read the Bible or study something")))
#+end_src

* Plugins
:properties:
:header-args: :tangle ~/.config/emacs/mine/src/plugins.el
:end:

** Plugin managers configuration
*** Configure package archives
Without it, all my configuration won't work

#+begin_src elisp
(setq package-archives '(("gnu" . "http://elpa.gnu.org/packages/")
						 ("nongnu" . "https://elpa.nongnu.org/nongnu/")
						 ("elpa" . "https://elpa.gnu.org/packages/") 
						 ("melpa" . "https://melpa.org/packages/")))
#+end_src

*** Setup package manager
#+begin_src elisp
(require 'package)
(package-initialize)
#+end_src

*** Bootstrap straight-use-package
Unfortunately, some packages are now dogshit and you can't
easily downgrade them. Therefore, i created some repos with
older versions and idk how to upload to melpa

#+begin_src elisp
(defvar bootstrap-version)
(let ((bootstrap-file
       (expand-file-name
        "straight/repos/straight.el/bootstrap.el"
        (or (bound-and-true-p straight-base-dir)
            user-emacs-directory)))
      (bootstrap-version 7))
  (unless (file-exists-p bootstrap-file)
    (with-current-buffer
        (url-retrieve-synchronously
         "https://raw.githubusercontent.com/radian-software/straight.el/develop/install.el"
         'silent 'inhibit-cookies)
      (goto-char (point-max))
      (eval-print-last-sexp)))
  (load bootstrap-file nil 'nomessage))
#+end_src

** Evil mode
The plugin allows to use vim motions inside emacs. I didn't really
like default keybindings and i missed =di=, =ci=, =da=, =ca= and many other
motions

*** Main evil-mode config
The leader is binded to =;=.
#+begin_src elisp
(use-package evil
  :ensure t
  :init
  (setq evil-want-integration t)
  (setq evil-want-keybinding nil)
  (setq evil-want-C-i-jump nil)
  :config
  (evil-mode 1)
  (evil-set-leader 'normal (kbd ";"))
  (evil-set-undo-system 'undo-redo)

  ;; insert mode
  (map-bind '(("\C-a" . evil-first-non-blank)
			  ("\C-e" . end-of-line)
			  ("\C-n" . next-line)
			  ("\C-p" . previous-line)) evil-insert-state-map)

  ;; visual mode
  (map-bind '(
			  ("\C-e" . end-of-line)
			  ) evil-visual-state-map)

  ;; normal mode
  (map-bind '(("\C-a"        . evil-first-non-blank)
			  ("\C-e"        . end-of-line)
			  ("gcc"         . comment-line)
			  ("gr"          . revert-buffer)
			  ("<leader>SPC" . counsel-dired)
			  ("<leader>w"   . split-right-switch-window)
			  ("<leader>W"   . split-below-switch-window)
			  ("<leader>of"  . counsel-find-file)
			  ("<leader>or"  . counsel-recentf)
			  ("<leader>xw"  . delete-other-windows)
			  ("<leader>xc"  . delete-window)
			  ("<leader>xC"  . kill-buffer-close-window)
			  ("<leader>Bb"  . counsel-evil-marks)
			  ("<leader>Ba"  . bookmark-set)
			  ("<leader>Bj"  . counsel-bookmark)
			  ("<leader>Bl"  . bookmark-bmenu-list)
			  ("<leader>Bd"  . bookmark-delete)
			  ("<leader>Br"  . bookmark-rename)
			  ("<leader>Bs"  . bookmark-save)
			  ("<leader>bb"  . switch-to-buffer)
			  ("<leader>bo"  . switch-to-buffer-other-window)
			  ("<leader>k"   . kill-buffer)
			  ("<leader>s"   . swiper)
			  ("<leader>;"   . evil-window-next)
			  ("<leader>:"   . other-window-backward)) evil-normal-state-map))
#+end_src

*** Macroses
To save macro, you need
1) In a buffer, do =q= *f* something here =q=. This will save a macro into
   the *f* register that inserts foobar into the buffer
2) Now run =M-x= name-last-kbd-macro =RET= macro-name =RET=
3) Go to this header and do =M-x= insert-kbd-macro =RET= mymacro =RET=

**** Format long string
When i copy some text from my school books, it is annoying to press
5J:s/- //ggqq, it is better to just press "5J =@f="

#+begin_src elisp
(defalias 'org-format-long-string
  (kmacro ": s / [-|­] SPC / / g <return> : s / ­ / / g <return> g q q")
  "Delete all '- ' and press gqq")

(evil-set-register ?f 'org-format-long-string)
#+end_src

**** Write numbers list
Create lists like that using only "5 =@n="
#+begin_example
1) [ ]
2) [ ]
3) [ ]
4) [ ]
5) [ ]
#+end_example

#+begin_src elisp
(defalias 'write-numbers-list
  (kmacro "y y p C-=")
  "Copy line and multiple first number that appears")

(evil-set-register ?n 'write-numbers-list)
#+end_src

**** Auto link
Make all text until end a link to header. Useful to link tasks in
org-mode

#+begin_src elisp
(defalias 'org-auto-link
  (kmacro "y $ v $ h C-c C-l C-y <return> <return>")
  "Link from point to end to header in current org document")

(evil-set-register ?l 'org-auto-link)
#+end_src

**** Auto link to other file
Not really a macro, but very useful thing

#+begin_src elisp
(defun org-auto-link-ask-file (filename)
  "Ask for file to link in and use everything from point to end as header name"
  (interactive "FChoose file to link: ")
  (let ((header-name (buffer-substring (point) (line-end-position))))
    (kill-region (point) (line-end-position))
    (org-insert-link nil
					 (format "file:%s::%s" filename header-name) header-name)))

(with-eval-after-load 'org
  (dolist (keybinding '("C-c u u" "M-o l"))
	(define-key org-mode-map (kbd keybinding) 'org-auto-link-ask-file)))
#+end_src

**** Move DEADLINE after SCHEDULED
#+begin_src elisp
(defalias 'org-move-scheduled-deadline
  (kmacro "d f > A SPC <escape> p 0 x")
  "Move '.*>' to the end")

(evil-set-register ?m 'org-move-scheduled-deadline)
#+end_src

**** Check and go down
#+begin_src elisp
(defalias 'check-fold-go-down
  (kmacro "C-S-c <tab> C-M-SPC")
  "Check the checkbox, fold and go down to the next")

(defalias 'check-go-down
  (kmacro "C-S-c C-M-SPC")
  "Check the checkbox and go down to the next")

(evil-set-register ?c 'check-fold-go-down)
(evil-set-register ?x 'check-go-down)
#+end_src

*** Additional evil-mode plugins
Evil mode for other plugins
#+begin_src elisp
(use-package evil-collection
  :after evil
  :ensure t
  :config
  (evil-collection-init))
#+end_src

Increment and decrement
#+begin_src elisp
(use-package evil-numbers
  :ensure t
  :bind (:map evil-normal-state-map
			  ("C--" . evil-numbers/dec-at-pt)
			  ("C-=" . evil-numbers/inc-at-pt)))
#+end_src

** Dependency plugins
Sometimes some plugins may not work without some plugins

*** Nerd icons
Here are nerd icons plugins. They are dependencies for
some plugins such as doom-modeline and treemacs

#+begin_src elisp
(use-package nerd-icons
  :ensure t
  :init (require 'nerd-icons nil t)
  :bind (:map global-map
			  ("C-c n" . nerd-icons-insert)))

(use-package nerd-icons-dired
  :ensure t
  :hook
  (dired-mode . nerd-icons-dired-mode))

(use-package all-the-icons
  :ensure t
  :init (require 'all-the-icons))
#+end_src

*** Flycheck
org-babel python evaluation doesn't work without this plugin

#+begin_src elisp
(use-package flycheck
  :ensure t
  :hook ((org-mode . flycheck-mode)
		 (prog-mode . (lambda () (flycheck-mode -1)))))
#+end_src

** Fuzzy finding
It's just based and comfy to use

#+begin_src elisp
(use-package ivy
  :ensure t
  :init
  (ivy-mode)
  :config
  (setq ivy-use-virtual-buffers t
        ivy-count-format "(%d/%d) "
		ivy-initial-inputs-alist nil
        enable-recursive-minibuffers t))

(use-package counsel
  :ensure t
  :bind
  ("C-c k t" . counsel-load-theme)
  ("C-c l i" . counsel-imenu)
  )

(use-package nerd-icons-ivy-rich
  :after ivy
  :ensure t
  :init
  (nerd-icons-ivy-rich-mode 1)
  (ivy-rich-mode 1))
#+end_src

** Better help pages
Helpful is an alternative to the built-in emacs help that provides
much more contextual information.

#+begin_src elisp
(use-package helpful
  :ensure t
  :init
  (setq counsel-describe-function-function #'helpful-callable
		counsel-describe-variable-function #'helpful-variable)
  :bind
  ([remap describe-function] . counsel-describe-function)
  ([remap describe-command] . helpful-command)
  ([remap describe-variable] . counsel-describe-variable)
  ([remap describe-key] . helpful-key))
#+end_src

** Autopairs
