config/emacs/mine/src/plugins.el
(setq package-archives '(("gnu" . "http://elpa.gnu.org/packages/")
						 ("nongnu" . "https://elpa.nongnu.org/nongnu/")
						 ("elpa" . "https://elpa.gnu.org/packages/") 
						 ("melpa" . "https://melpa.org/packages/")))

(require 'package)
(package-initialize)

(defvar bootstrap-version)
(let ((bootstrap-file
       (expand-file-name
        "straight/repos/straight.el/bootstrap.el"
        (or (bound-and-true-p straight-base-dir)
            user-emacs-directory)))
      (bootstrap-version 7))
  (unless (file-exists-p bootstrap-file)
    (with-current-buffer
        (url-retrieve-synchronously
         "https://raw.githubusercontent.com/radian-software/straight.el/develop/install.el"
         'silent 'inhibit-cookies)
      (goto-char (point-max))
      (eval-print-last-sexp)))
  (load bootstrap-file nil 'nomessage))

(use-package evil
  :ensure t
  :init
  (setq evil-want-integration t)
  (setq evil-want-keybinding nil)
  (setq evil-want-C-i-jump nil)
  :config
  (evil-mode 1)
  (evil-set-leader 'normal (kbd ";"))
  (evil-set-undo-system 'undo-redo)

  ;; insert mode
  (map-bind '(("\C-a" . evil-first-non-blank)
			  ("\C-e" . end-of-line)
			  ("\C-n" . next-line)
			  ("\C-p" . previous-line)) evil-insert-state-map)

  ;; visual mode
  (map-bind '(
			  ("\C-e" . end-of-line)
			  ) evil-visual-state-map)

  ;; normal mode
  (map-bind '(("\C-a"        . evil-first-non-blank)
			  ("\C-e"        . end-of-line)
			  ("gcc"         . comment-line)
			  ("gr"          . revert-buffer)
			  ("<leader>SPC" . counsel-dired)
			  ("<leader>w"   . split-right-switch-window)
			  ("<leader>W"   . split-below-switch-window)
			  ("<leader>of"  . counsel-find-file)
			  ("<leader>or"  . counsel-recentf)
			  ("<leader>xw"  . delete-other-windows)
			  ("<leader>xc"  . delete-window)
			  ("<leader>xC"  . kill-buffer-close-window)
			  ("<leader>Bb"  . counsel-evil-marks)
			  ("<leader>Ba"  . bookmark-set)
			  ("<leader>Bj"  . counsel-bookmark)
			  ("<leader>Bl"  . bookmark-bmenu-list)
			  ("<leader>Bd"  . bookmark-delete)
			  ("<leader>Br"  . bookmark-rename)
			  ("<leader>Bs"  . bookmark-save)
			  ("<leader>bb"  . switch-to-buffer)
			  ("<leader>bo"  . switch-to-buffer-other-window)
			  ("<leader>k"   . kill-buffer)
			  ("<leader>s"   . swiper)
			  ("<leader>;"   . evil-window-next)
			  ("<leader>:"   . other-window-backward)) evil-normal-state-map))

(defalias 'org-format-long-string
  (kmacro ": s / [-|­] SPC / / g <return> : s / ­ / / g <return> g q q")
  "Delete all '- ' and press gqq")

(evil-set-register ?f 'org-format-long-string)

(defalias 'write-numbers-list
  (kmacro "y y p C-=")
  "Copy line and multiple first number that appears")

(evil-set-register ?n 'write-numbers-list)

(defalias 'org-auto-link
  (kmacro "y $ v $ h C-c C-l C-y <return> <return>")
  "Link from point to end to header in current org document")

(evil-set-register ?l 'org-auto-link)

(defun org-auto-link-ask-file (filename)
  "Ask for file to link in and use everything from point to end as header name"
  (interactive "FChoose file to link: ")
  (let ((header-name (buffer-substring (point) (line-end-position))))
    (kill-region (point) (line-end-position))
    (org-insert-link nil
					 (format "file:%s::%s" filename header-name) header-name)))

(with-eval-after-load 'org
  (dolist (keybinding '("C-c u u" "M-o l"))
	(define-key org-mode-map (kbd keybinding) 'org-auto-link-ask-file)))

(defalias 'org-move-scheduled-deadline
  (kmacro "d f > A SPC <escape> p 0 x")
  "Move '.*>' to the end")

(evil-set-register ?m 'org-move-scheduled-deadline)

(defalias 'check-fold-go-down
  (kmacro "C-S-c <tab> C-M-SPC")
  "Check the checkbox, fold and go down to the next")

(defalias 'check-go-down
  (kmacro "C-S-c C-M-SPC")
  "Check the checkbox and go down to the next")

(evil-set-register ?c 'check-fold-go-down)
(evil-set-register ?x 'check-go-down)

(use-package evil-collection
  :after evil
  :ensure t
  :config
  (evil-collection-init))

(use-package evil-numbers
  :ensure t
  :bind (:map evil-normal-state-map
			  ("C--" . evil-numbers/dec-at-pt)
			  ("C-=" . evil-numbers/inc-at-pt)))

(use-package nerd-icons
  :ensure t
  :init (require 'nerd-icons nil t)
  :bind (:map global-map
			  ("C-c n" . nerd-icons-insert)))

(use-package nerd-icons-dired
  :ensure t
  :hook
  (dired-mode . nerd-icons-dired-mode))

(use-package all-the-icons
  :ensure t
  :init (require 'all-the-icons))

(use-package flycheck
  :ensure t
  :hook ((org-mode . flycheck-mode)
		 (prog-mode . (lambda () (flycheck-mode -1)))))

(use-package ivy
  :ensure t
  :init
  (ivy-mode)
  :config
  (setq ivy-use-virtual-buffers t
        ivy-count-format "(%d/%d) "
		ivy-initial-inputs-alist nil
        enable-recursive-minibuffers t))

(use-package counsel
  :ensure t
  :bind
  ("C-c k t" . counsel-load-theme)
  ("C-c l i" . counsel-imenu)
  )

(use-package nerd-icons-ivy-rich
  :after ivy
  :ensure t
  :init
  (nerd-icons-ivy-rich-mode 1)
  (ivy-rich-mode 1))

(use-package helpful
  :ensure t
  :init
  (setq counsel-describe-function-function #'helpful-callable
		counsel-describe-variable-function #'helpful-variable)
  :bind
  ([remap describe-function] . counsel-describe-function)
  ([remap describe-command] . helpful-command)
  ([remap describe-variable] . counsel-describe-variable)
  ([remap describe-key] . helpful-key))
