config/emacs/mine/src/standart-stuff.el

(defun copy-buffer-name ()
  (interactive)
  (kill-new buffer-file-name)
  (message "`%s' copied to clipboard" (buffer-file-name)))

(global-set-key (kbd "C-c {") 'copy-buffer-name)

(global-bind '(("n" . tab-new)
			   ("c" . tab-close)
			   ("C" . tab-close-other)
			   ("b" . switch-to-buffer-other-tab)
			   ("f" . find-file-other-tab)
			   ("d" . dired-other-tab)
			   ("s" . tab-switch)
			   ("r" . tab-rename)
			   ("o" . other-tab-prefix)) "C-x T")

(unless-conf-variable "profile" "macos"
  (menu-bar-mode -1)
  )

(tool-bar-mode -1)
(scroll-bar-mode -1)

(setq vc-follow-symlinks t)

(dolist (keybinding '("C-z" "C-x C-z"))
  (global-unset-key (kbd keybinding)))

(with-conf-variable "emacsEnableTetris" "no"
  (defun tetris ()
	"Print message to not play tetris"
	(interactive)
	(message "Don't play in it now. Read the Bible or study something")))
