config/emacs/mine/editor-config.org
*** Posthandler actions
The plugin doesn't indent out of the box, and i don't like when basic
things are not present

#+begin_src elisp
(defun indent-between-pair (&rest _ignored)
  "smartparens posthandler hook.
Create indent after pressing RET inside pair symbols"
  (newline)
  (indent-according-to-mode)
  (forward-line -1)
  (indent-according-to-mode))

(defun space-between-pair (&rest _ignored)
  "smartparens posthandler hook.
Create space after pressing SPC inside pair symbols and go backwards"
  (insert " ")
  (backward-char))
#+end_src

*** Main smartparens config
#+begin_src elisp
(use-package smartparens
  :ensure t
  :hook (prog-mode text-mode markdown-mode org-mode conf-unix-mode sxhkdrc-mode)
  :config
  (require 'smartparens-config)
  (setq smartparens-posthandlers '((indent-between-pair "RET")
								   (space-between-pair "SPC"))
		smartparens-posthandler-call-symbols '("{" "[" "(")
		smartparens-strict-mode nil)

  (sp-local-pair 'org-mode "~" nil :actions nil)
  (sp-local-pair 'org-mode "=" "=" :wrap "C-+")
  (sp-local-pair 'org-mode "*" "*" :wrap "C-_")
  (sp-local-pair 'org-mode "$" "$" :wrap "C-M-$")

  (dolist (symbol smartparens-posthandler-call-symbols)
	(sp-pair symbol nil :post-handlers smartparens-posthandlers)))
#+end_src

*** Disable posthandlers when running some commands
It is very annoying when you run `norm I- [ ]` and it gives extra
space between [ ]

#+begin_src elisp
(defun disable-smartparens-during-norm (orig-fun &rest args)
  "Disable Smartparens features during :norm command execution."
  (let ((sp-post-handlers nil)                ;; Disable posthandlers
        (sp-autoinsert-pair nil)              ;; Disable auto-pairing
        (sp-autoinsert-space nil)             ;; Disable auto space insertion
        (sp-pair-overlay-keymap nil)          ;; Disable overlays
        (sp-pair-overlay-list nil))           ;; Disable overlay list
    (apply orig-fun args)))                   ;; Run the original :norm

(advice-add 'evil-ex-normal :around #'disable-smartparens-during-norm)
#+end_src

** Org mode
*** Define useful functions
Insert functions can be useful for writing hw lists
#+begin_src elisp
(defun insert-header-counter ()
  (interactive)
  (end-of-line)
  (insert " [/] [%]")
  (org-ctrl-c-ctrl-c))

(defun insert-counter ()
  (interactive)
  (end-of-line)
  (insert " [/]")
  (org-ctrl-c-ctrl-c))

(defun insert-time ()
  (interactive)
  (insert (shell-command-to-string "date +%H:%M"))
  (evil-insert 1))

(defun insert-date ()
  (interactive)
  (insert (shell-command-to-string "date +%d.%m.%Y"))
  (evil-insert 1))

(defun create-header-insert-time ()
  (interactive)
  (org-insert-heading-after-current)
  (insert-time))

(defun create-header-insert-date ()
  (interactive)
  (org-insert-heading-after-current)
  (insert-date))
#+end_src

Open org-agenda and close other windows. It's useful when you want to
see agenda by pressing hotkey
#+begin_src elisp
(defun org-agenda-delete-windows ()
  (interactive)
  (org-agenda)
  (delete-other-windows))
#+end_src

*** Create prettify alist
Make emacs render symbols instead of symbol combinations
#+begin_src elisp
(defun load-prettify-symbols ()
  (interactive)
  (setq prettify-symbols-alist
		'(
		  ("#+begin_src"     . ?)
		  ("#+BEGIN_SRC"     . ?)
		  ("#+end_src"       . ?)
		  ("#+END_SRC"       . ?)
		  ("#+begin_example" . ?)
		  ("#+BEGIN_EXAMPLE" . ?)
		  ("#+end_example"   . ?)
		  ("#+END_EXAMPLE"   . ?)
		  ("#+begin_quote"   . ?)
		  ("#+BEGIN_QUOTE"   . ?)
		  ("#+end_quote"     . ?)
		  ("#+END_QUOTE"     . ?)
		  ("lambda"          . ?λ)
		  ))
  (prettify-symbols-mode 1))

(add-hook 'org-mode-hook 'load-prettify-symbols)
#+end_src

*** Fix some dogshit with evil and org mode
#+begin_src elisp
(defun disable-evil-autoindent ()
  (setq evil-auto-indent nil))

(add-hook 'org-mode-hook #'disable-evil-autoindent)
#+end_src

*** Config functions
Org-mode config is enormous without making it shorter using functions

Change header sizes. It makes document much more beautiful
#+begin_src elisp
(defun org-mode-configure-faces ()
  (with-eval-after-load 'org-faces
	  (dolist (face '((org-level-1 . 1.3)
					  (org-level-2 . 1.2)
					  (org-level-3 . 1.05)
					  (org-level-4 . 1.02)
					  (org-level-5 . 1.02)
					  (org-level-6 . 1.02)
					  (org-level-7 . 1.02)
					  (org-level-8 . 1.02)))
	  (set-face-attribute (car face) nil
						  :font "JetBrainsMono NFM Bold" :height (cdr face)))))
#+end_src

Change variables. The biggest org-mode config part. Here it adds
- metrics
- org agenda commands
- TODO keywords
- tags
#+begin_src elisp
(defun org-create-metric (type key title file columns &rest parameters)
  "Create an org-capture template entry for metrics"
  `(,key ,title ,type (file ,file) ,columns ,@parameters))

(defun org-mode-change-variables ()
  (setq-default org-display-custom-times t)
  (setq org-log-done 'time
		org-export-with-broken-links t
		org-hide-emphasis-markers t
		org-time-stamp-custom-formats '("<%d.%m.%Y %a>" . "<%d.%m.%Y %H:%M %a>")
		org-format-latex-options (plist-put org-format-latex-options :scale 1.5)
		org-agenda-span 10
		org-agenda-start-on-weekday nil
		org-startup-with-inline-images t
		org-startup-indented t
		org-startup-folded t
		org-agenda-skip-scheduled-if-done t
		org-priority-highest ?A
		org-plantuml-jar-path "/usr/share/java/plantuml/plantuml.jar"
		org-priority-default ?B
		org-priority-lowest  ?C
		org-latex-create-formula-image-program 'dvipng
		org-image-actual-width nil
		org-ellipsis " "
		org-agenda-include-diary t
		org-list-allow-alphabetical t
		org-src-preserve-indentation 0)

  (setq org-capture-templates
      (list
       '("m" "Metrics")
	   (org-create-metric 'table-line "mp" "Head pain" "~/Org/metrics/pain.org"
                          "| %U | %^{length} | %^{strength} | %^{in nose?} |"
                          :kill-buffer t)

	   (org-create-metric 'table-line "mt" "Body temperature"
						  "~/Org/metrics/body-temperature.org"
                          "| %U | %^{body temperature} | %^{how do you feel} |"
                          :kill-buffer t)

	   (org-create-metric 'table-line "mw" "Body weight" "~/Org/metrics/weight.org"
						  "| %U | %^{weight} | %^{is fat?} |"
                          :kill-buffer t)

	   (org-create-metric 'table-line "mb" "Blood leak" "~/Org/metrics/blood-leak.org"
                          "| %U | %^{duration (seconds)} | %^{something special?} |"
                          :kill-buffer t)

	   (org-create-metric
		'table-line "mD" "Dark urge"
		"~/Org/metrics/dark-urge.org"
		"| %U | %^{thought} | %^{person that was harmed} | %^{event before} | %^{strength} | %^{comments}"
		:kill-buffer t)

	   (org-create-metric 'entry "md" "Diary" "~/Org/metrics/thoughts.org"
						  "\n* %^{Thought title}\n%U\n%?\n"
						  :clock-in t :clock-resume t :prepend t)
	   ))

  (setq org-agenda-custom-commands '(("M" "Monthly agenda"
									  ((agenda "" ((org-agenda-span 'month)))) nil)
									  ("y" "Yearly agenda"
									  ((agenda "" ((org-agenda-span 'year)))) nil)))

  (setq org-todo-keywords
	  '((sequence
		  "TODO(t)" "PROJECT(p)" "DOING(T)" "ACTIVE(a)" "NEXT(n)"
		  "START(s)" "FINISH(R)" "PLAN(P)" "IMPROVE(i)"
		  "|"
		  "DONE(d/!)" "CANCEL(c@/!)" "WAIT(w)" "FAILED(f)"
		  )
		(sequence "HUMAN(h)" "|" "DONE(d)")
		(sequence "BUG(b)" "|" "DONE(F)")
		(sequence "FIX(d)" "|" "DONE(d)")
		(sequence "REMEMBER(r)" "|" "DONE(d)")
		(sequence "LEARN(L)" "|" "DONE(d)"))))
#+end_src

