config/emacs/mine/src/plugins.el

  (plist-put org-format-latex-options :background "Transparent")
  
  (org-babel-do-load-languages
	  'org-babel-load-languages
	  '((python . t)
		(emacs-lisp . t)
		(shell . t)
		(plantuml . t)
		(lua . t)
		(C . t)
		(sql . t)
	  ))

  (evil-define-key '(normal visual motion) org-mode-map
			  "gj" 'evil-next-visual-line
			  "gk" 'evil-previous-visual-line)

  :bind (:map global-map
			  ("M-o a"   . org-agenda)
			  ("C-c C-'" . org-edit-src-exit)
			  ("C-c C--" . org-edit-src-exit)
			  ("C-c x"   . org-capture)

			  ;; pomodoro timer
			  ("M-o P s"   . org-timer-set-timer)
			  ("M-o P S"   . org-timer-stop)
			  ("M-o P b"   . org-timer-start)
			  ("M-o P SPC" . org-timer-pause-or-continue)
			  )

		  (:map org-mode-map
				("C-<tab>" . org-cycle)
				("C-c c" . insert-header-counter)
				("C-c C" . insert-counter)
				("C-c t" . org-todo)
				("C-M-i" . org-toggle-inline-images)
				("C-S-C" . org-toggle-checkbox)
				("M-p" . org-move-subtree-up)
				("M-n" . org-move-subtree-down)
				("M-o s s" . org-schedule)
				("M-o s d" . org-deadline)
				("M-o e" . org-export-dispatch)
				("C-M-SPC"   . org-next-item)
				("C-M-S-SPC" . org-previous-item)
				("C-c RET" . org-insert-subheading)
				("M-o t" . org-babel-tangle)
				("C-c i d" . create-header-insert-date)
				("C-c i t" . create-header-insert-time)
				("C-c i T" . insert-time)
				("C-c i D" . insert-date)
				("C-c C-'" . org-edit-special)
				("C-M-h" . org-table-move-column-left)
				("C-M-l" . org-table-move-column-right)
				("C-c C--" . org-edit-latex-fragment)
				("C-c u k" . org-priority-up)
				("C-c u j" . org-priority-down)
				("C-}" . org-ctrl-c-minus)))

(use-package org-superstar
  :ensure t
  :hook (org-mode . org-superstar-mode)
  :config
  (setq org-superstar-headline-bullets-list '("◉" "○" "" "✿")))

(use-package org-roam
  :ensure t
  :after org
  :init
  (setq org-roam-v2-ack t)
  :config
  (setq org-roam-directory "~/Org/roam")
  :bind (:map org-mode-map
			  ("M-o r s" . org-roam-db-sync)
			  ("M-o r t" . org-roam-buffer-toggle)
			  ("M-o r i" . org-roam-node-insert)
			  ("M-o r f" . org-roam-node-find)))

(use-package org-contrib
  :ensure t
  :after org
  :init
  (require 'ox-extra)
  (require 'org-checklist)
  (require 'org-invoice)
  (ox-extras-activate '(ignore-headlines)))

(use-package org-drill
  :ensure t)

(with-conf-variable "emacsEnableOldVersionConfig" "no"
  (use-package org-gcal
	:ensure t
	:after org
	:straight (org-gcal
			   :host github
			   :type git
			   :repo "kidd/org-gcal.el")
	;; If you want to use the plugin, you need to configure these variables
	;; in src/local.el.
	;; Follow guide on line below in order to configure these variables
	;; https://github.com/kidd/org-gcal.el/blob/master/README.org.
	;; 
	;; + org-gcal-client-id
	;; + org-gcal-client-secret
	;; + org-gcal-file-alist
	:bind (:map org-mode-map
				("M-o S b" . org-gcal-sync-buffer)
				("M-o S a" . org-gcal-sync)
				("M-o S p" . org-gcal-post-at-point))))

(use-package org-wild-notifier
  :ensure t
  :config
  (org-wild-notifier-mode)
  (setq org-wild-notifier-alert-time '(1)
		org-wild-notifier--alert-severity 'low
		org-wild-notifier-notification-title "org-agenda"
		org-wild-notifier-notification-icon (format
											 "/home/%s/.config/emacs/mine/src/resources/icons/org-mode-unicorn.png"
											 user-login-name)
		alert-default-style 'libnotify
		alert-fade-time 40))

(with-conf-variable "emacsEnableOrgTrello" "yes"
  (use-package org-trello
	:ensure t
	:config
	(custom-set-variables
	 '(org-trello-files '(
						  "~/Org/trello/balandins-trello.org"
						  "~/Org/trello/test.org"
						  )))))

(use-package org-download
  :ensure t
  :config
  (setq-default org-download-image-dir "~/Org/images/downloaded/")
  :bind (:map org-mode-map
			  ("M-o d" . org-download-image)))

(use-package org-appear
  :ensure t
  :hook
  (org-mode . org-appear-mode))

(use-package org-inline-anim
  :ensure t
  :hook (org-mode . org-inline-anim-mode))

(use-package toc-org
  :ensure t
  :hook (org-mode . toc-org-mode))

;; (load "~/.config/emacs/mine/src/not-mine/org+align-table.el")

;; (add-hook 'org-mode-hook 'org+-align-table-mode)

(defun enable-visual-fill-column ()
  (interactive)
  (visual-fill-column-mode)
  (display-line-numbers-mode 0))

(defun disable-visual-fill-column ()
  (interactive)
  (visual-fill-column-mode 0)
  (display-line-numbers-mode t))

(defun visual-fill-column-enable-center ()
  (setq visual-fill-column-center-text t))

(add-hook 'org-mode-hook #'visual-fill-column-enable-center)

(use-package visual-fill-column
  :ensure t
  :straight (visual-fill-column
			 :host github
			 :repo "nobody926/visual-fill-column")
  :hook (visual-line-mode-hook . visual-fill-column-mode)
  :config
  (setq visual-fill-column-center-text t)
  (advice-add 'text-scale-adjust :after #'visual-fill-column-adjust)
  :bind (:map org-mode-map
    ("M-o i e" . enable-visual-fill-column)
    ("M-o i d" . disable-visual-fill-column)))
