config/emacs/mine/editor-config.org
*** Define enable presentation functions
- Enable presentation mode does:
  + Show images
  + Remap faces
  + Enable [[Visual fill column][visual-fill-column]]
  + Run org-present
  + Increases text size by 4
  + Increase LaTeX preview to 2.0
  + Disables [[Ewal][ewal]]
  + Enables [[Doom emacs ui elements][doom-nord]] theme if user wants
- Disable presentation mode does
  + Disable [[Visual fill column][visual-fill-column]]
  + Run org-present-quit
  + Enables [[Ewal][ewal]]
  + Revert faces

We need variables to configure LaTeX previews
#+begin_src elisp
(defvar org-latex-previews-presentation-font-size 2.5
  "Org LaTeX preview font size for when (enable-presentation-mode) is running")

(defvar org-latex-previews-on-disable-font-size 1.5
  "Org LaTeX preview font size for when (enable-presentation-mode) stopped running")
#+end_src

#+begin_src elisp
(defun enable-presentation-mode ()
  (text-scale-increase 4)
  (org-latex-preview-scale-change org-latex-previews-presentation-font-size)

  (org-display-inline-images)
  (enable-visual-fill-column)
  (org-present)

  (when (y-or-n-p (format "Load theme %s?" (get-theme "presentation")))
	(disable-ewal "presentation"))

  (message "Press C-c C-x C-l to enable LaTeX fragments"))

(defun disable-presentation-mode ()
  (text-scale-set 0)
  (org-latex-preview 0)
  (org-latex-preview-scale-change org-latex-previews-on-disable-font-size)

  (org-remove-inline-images)
  (disable-visual-fill-column)
  (org-present-quit)

  (if-conf-variable "colorscheme" "pywal"
	(enable-ewal)
	(disable-ewal)))
#+end_src

Define minor-mode
#+begin_src elisp
(define-minor-mode org-presentation-mode
  "Toggle 'org-presentation-mode' on or off"
  :interactive t
  :init-value nil
  (if (derived-mode-p 'org-mode)
	  (if (eq org-presentation-mode nil)
		  (disable-presentation-mode)
		(enable-presentation-mode))
	(progn
	  (setq org-presentation-mode nil)
	  (message "You can use this minor-mode only in org-mode"))))
#+end_src

*** Export presentation
Sometimes i need to show my presentations at school and teachers
don't heave emacs and all those plugins installed. Therefore,
presentations should be exported to some formats that people
can see without emacs

Run script. I tried to do that in elisp by launching async-shell-command.
It took screenshot of last slide because idk. Therefore, i decided not to
fuck my brain and my nerves and do it using shell
#+begin_src elisp
(defun org-presentation-export ()
  "Export presentation to pdf format. This one will have name
according to header 'PRESENTATION_EXPORT_NAME' in org-mode. This
function call script '~/.config/scripts/emacs/org-presentation-export'.
You can also configure this script by configuring settings.conf
variables
- '$emacsOPEcopyOutputPath'
- '$emacsOPEworkdir'"
  (interactive)
  (if (bound-and-true-p org-present-mode)
	(start-process-shell-command "async-shell-command" nil
								 (concat
								  "~/.config/scripts/emacs/org-presentation-export "
								  buffer-file-name " "
								  (org-get-keyword-variable-value
								   "PRESENTATION_EXPORT_NAME")))
	(message "You need to activate org-present-mode first")))
#+end_src

It works like
1) Read slides
2) Copy path of output, if set =$emacsOPEcopyOutputPath= to =yes=
   To get file path, you need to copy from clipboard manager the file
   name
3) Loop through them and take screenshots into $workingDirectory
4) Convert in pdf to $output

You can also only print images. Sometimes it is useful
#+begin_src elisp
(defun org-presentation-export-images ()
  "Export presentation to images to '$emacsOPEworkdir'. This one will have name
according to header 'PRESENTATION_EXPORT_NAME' in org-mode. This
function call script '~/.config/scripts/emacs/org-presentation-export'.
You can also configure this script by configuring settings.conf
variables
- '$emacsOPEcopyOutputPath'
- '$emacsOPEworkdir'"
  (interactive)
  (if (bound-and-true-p org-present-mode)
	(start-process-shell-command "async-shell-command" nil
								 (concat
								  "~/.config/scripts/emacs/org-presentation-export "
								  buffer-file-name " "
								  (org-get-keyword-variable-value
								   "PRESENTATION_EXPORT_NAME") " "
								  "--photos-only"))
	(message "You need to activate org-present-mode first")))
#+end_src

*** Main org-present config
#+begin_src elisp
(use-package org-present
  :ensure t
  :config
  (setq org-present-hide-stars-in-headings nil)
  :bind (:map org-mode-map
    ("M-o p p" . org-presentation-mode)
    ("M-o p e" . org-presentation-export)
    ("M-o p E" . org-presentation-export-images)
    ("C-S-T" . org-present)
    ("C->" . org-present-next)
    ("C-<" . org-present-prev)))
#+end_src

** Rainbow
rainbow-delimiters is a "rainbow parentheses"-like mode which
highlights delimiters such as parentheses, brackets or braces
according to their depth. Helps to read code

#+begin_src elisp
(use-package rainbow-delimiters
  :ensure t
  :hook (prog-mode . rainbow-delimiters-mode))
#+end_src

Highlight colors to easily customize colors
#+begin_src elisp
(use-package rainbow-mode
  :ensure t
  :hook (org-mode prog-mode conf-mode))
#+end_src

** Ui stuff
*** Doom emacs
Here are doom modeline and doom themes. Doom themes are used in
- [[Org mode presentations][org mode presentations]]
- [[Reader mode][reader mode]]

#+begin_src elisp
(use-package doom-modeline
  :ensure t
  :init
  (doom-modeline-mode)
  :config
  (setq doom-modeline-height 36
        doom-modeline-modal-icon 'evil
        doom-modeline-evil-indicator t))

(use-package doom-themes
  :ensure t
  :config
  ;; Global settings (defaults)
  (setq doom-themes-enable-bold t    ; if nil, bold is universally disabled
		;; use "doom-colors" for less minimal icon theme
        doom-themes-treemacs-theme "doom-atom"
		doom-themes-treemacs-enable-variable-pitch nil
        doom-themes-enable-italic nil) ; if nil, italics is universallyb disabled

  ;; Enable flashing mode-line on errors
  (doom-themes-visual-bell-config)
  ;; Enable custom neotree theme (all-the-icons must be installed!)
  (doom-themes-neotree-config)
  ;; or for treemacs users
  (doom-themes-treemacs-config)
  ;; Corrects (and improves) org-mode's native fontification.
  (doom-themes-org-config))

(with-conf-variable "emacsEnableOldVersionConfig" "no"
  (use-package doom-everblush-theme
	:ensure t
	:straight (doom-everblush-theme
			   :type git
			   :host github
			   :repo "Everblush/doomemacs")))
#+end_src

*** Indentation lines
#+begin_src elisp
(use-package highlight-indent-guides
  :ensure t
  :hook (prog-mode yaml-mode)
  :config
  (setq highlight-indent-guides-method 'character))
#+end_src

*** Ewal
The plugin uses doom themes and syncs with pywal

