config/emacs/mine/src/plugins.el

(defvar transparency-level 93
  "Transparency level for emacs. It is used in functions that set
transparency")

(defun get-theme (&optional choice)
  "If CHOICE is not nil, it will choose theme depending on this variable.
Here are values of this parameter
'presentation' --> doom-nord-light
'reader' --> doom-gruvbox-light

If CHOICE is nil, it will pick return theme depending on $colorscheme
from settings.conf. You can find available colorschemes in
~/.files-balamah/src/colorschemes
"
  (if choice
	  (progn (pcase choice
			   ("presentation" 'doom-nord-light)
			   ("reader" 'doom-gruvbox-light)))
	(progn (pcase (read-conf-variable "~/.files-balamah/settings.conf"
									  "colorscheme")
			 ((or "onedark-gray" "onedark-cyan") 'doom-one)
			 ("gruvbox"                          'doom-gruvbox)
			 ("dracula"                          'doom-dracula)
			 ("everblush"                        'doom-everblush)
			 ("nord"                             'doom-nord)
			 ("pywal"                            'ewal-doom-one)))
	)
  )

(defun disable-themes ()
  "Disable all loaded themes"
  (dolist (theme custom-enabled-themes)
	(disable-theme theme)))

(defun disable-ewal (&optional is-not-coding)
  "Check documentation for 'get-theme' to get lawful values of
parameter 'is-not-coding'"

  (disable-themes)
  (if-conf-variable "transparencyWithoutPywal" "no"
	(change-transparency 100)
	(change-transparency transparency-level))
  (if is-not-coding
      (load-theme (get-theme is-not-coding) t)
	(load-theme (get-theme) t)))

(defun disable-ewal-for-toggle ()
  "It disables ewal for 'ewal-mode', for toggling.
This function depends on '$emacsAlternateTheme'"
  (let* ((theme (read-conf-variable
				 "~/.files-balamah/settings.conf" "emacsAlternateTheme"))
		 (theme-to-load (if (equal theme "current")
							(get-theme)
						  (intern theme))))
	(load-theme theme-to-load t))
  (if-conf-variable "transparencyWithoutPywal" "no"
	(change-transparency 100)
	(change-transparency transparency-level)))

(defun enable-ewal ()
  (disable-themes)
  (with-conf-variable "colorscheme" "pywal"
	(change-transparency transparency-level)
	(load-theme 'ewal-doom-one t))

  (unless-conf-variable "colorscheme" "pywal"
	(load-theme (get-theme) t)))

;; FUCK: I couldn't convert this to minor-mode for it causes recursion.
;; Don't know why

(defvar ewal-mode nil)

(defun ewal-mode ()
  (interactive)
  (if (eq ewal-mode nil)
      (disable-ewal-for-toggle)
	(enable-ewal))

  (setq ewal-mode (not ewal-mode)))

(defun ewal-mode-presentation ()
  (interactive)
  (if (eq ewal-mode nil)
      (disable-ewal "presentation")
	(enable-ewal))

  (setq ewal-mode (not ewal-mode)))

(use-package ewal-doom-themes
  :ensure t
  :if (equal system-type 'gnu/linux)
  :bind
  ("C-c w" . ewal-mode)
  ("C-c W" . ewal-mode-presentation)
  :config
  (setq ewal-built-in-palette "sexy-material"))

(with-eval-after-load 'doom-themes
  (load-theme (get-theme) t))

(defun dashboard-dired-open-dotfiles (&rest _)
  (dired "~/.files-balamah"))

(defun dashboard-open-dotfiles-readme (&rest _)
  (find-file "~/.files-balamah/README.org"))

(defun dashboard-edit-emacs-config (&rest _)
  (find-file "~/.files-balamah/config/emacs/mine/editor-config.org"))

(defun dashboard-package-upgrade-all (&rest _)
  (when (y-or-n-p "Are you sure you want to upgrade plugins?")
	(package-refresh-contents)
	(package-upgrade-all)))

(defun dashboard-restart-emacs (&rest _)
  (restart-emacs-ask))

(defun dashboard-scratch-buffer (&rest _)
  (scratch-buffer))

(defun dashboard-open-org-agenda (&rest _)
  (org-agenda))

(defun dashboard-counsel-bookmark (&rest _)
  (call-interactively 'counsel-bookmark))

(defun dashboard-projectile-switch-project (&rest _)
  (projectile-find-file))

(defun dashboard-councel-load-theme (&rest _)
  (counsel-load-theme))

(defun dashboard-ewal-mode (&rest _)
  (ewal-mode))

(defun emacsclient-dashboard-start ()
  "Start dashboard on start of 'emacsclient -c'"
  (dashboard-refresh-buffer)
  (get-buffer "*dashboard*"))

(use-package dashboard
  :ensure t
  :init
  (setq dashboard-banner-logo-title "Welcome to GNU Emacs"
        dashboard-show-shortcuts t
        dashboard-display-icons-p t
        dashboard-icon-type 'nerd-icons
        dashboard-set-heading-icons t
        dashboard-set-file-icons t
        dashboard-startupify-list '(dashboard-insert-banner
                                    dashboard-insert-newline ;; newline
                                    dashboard-insert-banner-title
                                    dashboard-insert-newline ;; newline
                                    dashboard-insert-navigator
                                    dashboard-insert-newline ;; newline
                                    dashboard-insert-init-info
                                    dashboard-insert-items
									dashboard-insert-footer)
        dashboard-center-content t
        dashboard-startup-banner "~/.config/emacs/mine/src/resources/icons/10.txt"
        dashboard-items-face t)
  ;; here are 3 colors:
  ;; normal, warning, error
  (with-conf-variable "emacsDashboardOption" "buttons"
	(setq dashboard-navigator-buttons
		  `(;; dotfiles
			(("" "Dotfiles"
			  "Open ~/.files-balamah/ directory\ndashboard-dired-open-dotfiles"
			  dashboard-dired-open-dotfiles)
			 ("" "Dotfiles guide"
			  "Open ~/.files-balamah/README.org\ndashboard-open-dotfiles-readme"
			  dashboard-open-dotfiles-readme)
			 )
			(;; dashboard sections substitution
			 ("" "Open project files"
			  "Open files from projects\ndashboard-projectile-switch-project"
			  dashboard-projectile-switch-project)
			 ("" "Open scratch buffer"
			  "Open scratch buffer to write something\ndashboard-scratch-buffer"
			  dashboard-scratch-buffer)
			 ("" "Jump to bookmark"
			  "Open file at location quickly\ncounsel-bookmark"
			  dashboard-counsel-bookmark)
			 )
			(;; org-mode stuff
			 ("" "Org agenda"
			  "Open org-agenda using M-o a\ndashboard-open-org-agenda"
			  dashboard-open-org-agenda)
			 ("" "Emacs config"
			  "Open emacs org config\ndashboard-edit-emacs-config"
			  dashboard-edit-emacs-config)
			 )
			(;; emacs actions
			 ("" "Upgrade plugins"
			  "Upgrade emacs packages to new versions\ndashboard-package-upgrade-all"
			  dashboard-package-upgrade-all error)
			 ("" "Restart emacs"
			  "Restart emacs\ndashboard-restart-emacs"
			  dashboard-restart-emacs error)
			 ("" "Change theme"
			  "Change emacs ui theme\ndashboard-councel-load-theme"
			  dashboard-councel-load-theme error)
			 ("" "Toggle theme"
			  "Toggle between pywal and onedark\ndashboard-ewal-mode"
			  dashboard-ewal-mode error)))
        dashboard-items '((recents  . 10)
						  )))
  (with-conf-variable "emacsDashboardOption" "elements"
	(setq dashboard-items '((recents  . 5)
							(bookmarks . 5)
							(agenda . 6))))
  :config
  (dashboard-setup-startup-hook)
  (setq initial-buffer-choice 'emacsclient-dashboard-start)
  (global-set-key (kbd "C-c b") 'dashboard-open)

  (dolist (message '("Christ is the LORD" 
                   "Ο Ιησούς Χριστός είναι Κυρίως"
                   "Focus on the task"))
	(add-to-list 'dashboard-footer-messages message)))
