config/emacs/mine/src/plugins.el

(with-conf-variable "emacsDashboardOption" "doom"
  (use-package doom-dashboard
	:straight (doom-dashboard-fixed
			   :host github
			   :repo "nobody926/doom-dashboard-fixed")
	:after dashboard
	:demand t
	:bind (:map dashboard-mode-map
				("<remap> <dashboard-previous-line>" . widget-backward)
				("<remap> <dashboard-next-line>" . widget-forward)
				("<remap> <previous-line>" . widget-backward)
				("<remap> <next-line>"  . widget-forward)
				("<remap> <right-char>" . widget-forward)
				("<remap> <left-char>"  . widget-backward))
	:custom
	(dashboard-banner-logo-title "Balamah's Emacs")
	(dashboard-startup-banner "~/.config/emacs/mine/src/resources/icons/10.txt")
	(dashboard-footer-icon
	 (nerd-icons-faicon "nf-fa-github_alt" :face 'success :height 1.5))
	(dashboard-page-separator "\n")
	(dashboard-startupify-list `(dashboard-insert-banner
								 dashboard-insert-banner-title
								 dashboard-insert-items
								 ,(dashboard-insert-newline 2)
								 dashboard-insert-init-info
								 ,(dashboard-insert-newline 2)
								 doom-dashboard-insert-homepage-footer))
	(dashboard-item-generators
	 '((recents   . doom-dashboard-insert-recents-shortmenu)
	   (bookmarks . doom-dashboard-insert-bookmark-shortmenu)
	   (projects  . doom-dashboard-insert-project-shortmenu)
	   (agenda    . doom-dashboard-insert-org-agenda-shortmenu)))
	(dashboard-items '(projects agenda bookmarks recents))))

(use-package keycast
  :ensure t)

(defun custom-monkeytype-mode-hook ()
  "Hooks for monkeytype-mode"
  (evil-insert -1))

(use-package monkeytype
  :ensure t
  :config (add-hook 'monkeytype-mode-hook #'custom-monkeytype-mode-hook)
  :bind (:map org-mode-map
			  ("C-c M" . monkeytype-region)))

(use-package evil-string-inflection
  :ensure t
  :bind (:map global-map
			  ("C-{" . string-inflection-all-cycle)))

(use-package emacs-everywhere
  :ensure t
  :config
  (setq emacs-everywhere-major-mode-function 'org-mode))

(defun add-project (dir)
  (interactive (list (read-directory-name "Add to known projects: ")))
  (projectile-add-known-project dir)
  (treemacs-add-project dir))

(use-package projectile
  :ensure t
  :config
  (projectile-mode)
  (setq projectile-resolve-symlinks nil)
  :bind (:map global-map
			  ("C-c C-p C-a" . add-project)
			  ("C-c C-p C-r" . projectile-remove-known-project)
			  ("C-c C-p C-s" . projectile-switch-project)
			  ("<leader>Ps" . projectile-switch-project)
			  ("<leader>Pf" . projectile-find-file)
			  ("<leader>Pg" . projectile-grep)
			  ))

(require 'cl-lib)

(defun file-truename-with-symlink-preserved (orig-fn &rest args)
  "Prevent resolving symlinks in file paths under certain directories."
  (let* ((file (car args))
         (directories-original (read-conf-variable
                                (expand-file-name "~/.files-balamah/settings.conf")
                                "emacsFileSymlinkPreserveDirectories"))
         (directories (split-string directories-original ",")))
    (if (cl-some (lambda (directory)
                   (string-prefix-p (expand-file-name (string-trim directory))
                                    (expand-file-name file)))
                 directories)
        (expand-file-name file)
      (apply orig-fn args))))

(with-conf-variable "emacsFileSymlinkPreserve" "yes"
  (advice-add 'file-truename :around #'file-truename-with-symlink-preserved))

(defun around-projectile-without-resolving-symlinks (orig-fn &rest args)
  "Temporarily disable symlink resolution inside Projectile."
  (cl-letf (((symbol-function 'file-truename)
             (lambda (f) (expand-file-name f))))
    (apply orig-fn args)))

(with-conf-variable "emacsFileGlobalSymlinkPreserve" "yes"
  (advice-add 'projectile-project-root
			:around #'around-projectile-without-resolving-symlinks))

(use-package treemacs
  :ensure t
  :defer t
  :bind
  (:map global-map
			  ("M-0" . treemacs))
  (:map treemacs-mode-map
		("C-<tab>" . treemacs-TAB-action))
  :config
  (setq treemacs-no-png-images t))

(use-package treemacs-evil
  :after (treemacs evil)
  :ensure t)

(use-package treemacs-nerd-icons
  :after (treemacs evil)
  :ensure t
  :config (treemacs-load-theme "nerd-icons"))

(use-package treemacs-projectile
  :after (treemacs projectile)
  :ensure t)

(use-package transpose-frame
  :ensure t
  :bind ((:map global-map
			   ("C-$" . flop-frame)
			   ("C-%" . transpose-frame)
			   ("<leader>ff" . flop-frame)
			   ("<leader>ft" . transpose-frame)
			   )))

(use-package dired-open-with
  :ensure t
  :after dired
  :bind (:map dired-mode-map
			  ("C-S-<return>" . dired-open-with)))

(use-package dired
  :ensure nil
  :commands (dired dired-jump)
  :config
  (require 'dired-x)
  (setq dired-listing-switches "-lhaF --group-directories-first"
		dired-kill-when-opening-new-dired-buffer t
		dired-dwim-target t
		dired-guess-shell-alist-user '(("\\.gif\\'"  . "sxiv")
                                       ("\\.jpg\\'"  . "sxiv")
                                       ("\\.png\\'"  . "sxiv")
                                       ("\\.webp\\'" . "sxiv")
                                       ("\\.mkv\\'"  . "mpv")
                                       ("\\.mp4\\'"  . "mpv")))
  (evil-collection-define-key 'normal 'dired-mode-map
	"h" 'dired-up-directory
	"l" 'dired-find-file
	")" 'dired-create-empty-file
	"%p" 'set-file-modes))

(with-conf-variable "emacsEnableOldVersionConfig" "yes"
  (use-package which-key
    :ensure t
    :straight (which-key
			   :host github
			   :repo "justbur/emacs-which-key")
	:init
	(require 'which-key)
	(which-key-mode)))

(use-package pyvenv
  :ensure t
  :init
  (pyvenv-mode t)
  :config
  (setq pyvenv-post-activate-hooks
        (list (lambda ()
                (setq python-shell-interpreter
                      (concat pyvenv-virtual-env "/bin/python3")))))
  (setq pyvenv-post-deactivate-hooks
        (list (lambda ()
                (setq python-shell-interpreter "python3"))))

  :bind (:map global-map
          ("C-c p a" . pyvenv-activate)
          ("C-c p d" . pyvenv-deactivate)
         :map evil-normal-state-map
          ("<leader>pa" . pyvenv-activate)
          ("<leader>pd" . pyvenv-deactivate))
          )

(use-package drag-stuff
  :ensure t
  :init
  (drag-stuff-global-mode 1)
  :bind
  (:map global-map
		("M-H" . drag-stuff-left)
		("M-L" . drag-stuff-right)
		("M-J" . drag-stuff-down)
		("M-K" . drag-stuff-up)))
