config/emacs/mine/src/plugins.el

(use-package dotenv-mode :ensure t)
(use-package yaml-mode :ensure t)
(use-package dockerfile-mode :ensure t)
(use-package logview :ensure t)
(use-package git-modes :ensure t)
(use-package lua-mode :ensure t)
(use-package crontab-mode :ensure t)
(use-package twig-mode :ensure t)
(use-package sxhkdrc-mode :ensure t)
(use-package plantuml-mode :ensure t)
(use-package groovy-mode :ensure t)
(use-package ebuild-mode :ensure t
  :straight (ebuild-mode :host github :repo "emacsmirror/ebuild-mode"))

(use-package gradle-mode
  :ensure t
  :hook (java-mode . gradle-mode))

(use-package holyc-mode
  :ensure t
  :straight (holyc-mode
			 :host github
			 :repo "Naheel-Azawy/holyc-mode.el"))

(use-package hl-todo
  :ensure t
  :hook ((prog-mode . hl-todo-mode)
		 (yaml-mode . hl-todo-mode) )
  :config
  (setq hl-todo-highlight-punctuation ":"
        hl-todo-keyword-faces
        '(("TODO" warning bold)
          ("FIXME" error bold)
          ("REVIEW" font-lock-keyword-face bold)
          ("HACK" font-lock-constant-face bold)
          ("DEPRECATED" font-lock-doc-face bold)
          ("NOTE" success bold)
          ("BUG" error bold)
          ("FUCK" error bold)
          ("XXX" font-lock-constant-face bold))))

(use-package doom-todo-ivy
  :ensure t
  :straight (doom-todo-ivy
			 :host github
			 :repo "jsmestad/doom-todo-ivy")
  :init
  (require 'doom-todo-ivy)
  :bind (:map global-map
			  ("C-c C-x t" . doom/ivy-tasks)))

(use-package yasnippet
  :ensure t
  :init
  (yas-global-mode 1)
  :config
  (require 'warnings)
  (setq yas-snippet-dirs '("~/.config/emacs/mine/snippets")
        yas-indent-line 'fixed)
  (add-to-list 'warning-suppress-types '(yasnippet backquote-change)))

(use-package magit
  :ensure t
  :bind ("C-x g" . magit-status))

(use-package docker
  :ensure t
  :bind ("C-c 1 d" . docker))

(use-package lsp-mode
  :ensure t
  :init
  (setq lsp-keymap-prefix "C-c l")
  :config
  (lsp-enable-which-key-integration t)
  (setq lsp-headerline-breadcrumb-enable nil
		lsp-enable-file-watchers nil)
  :bind (:map lsp-mode-map
			  ("C-<return>" . lsp-find-definition)
			  ("C-S-<return>" . flycheck-list-errors)))

(use-package lsp-ui
  :ensure t)

(use-package lsp-treemacs
  :ensure t
  :disabled t)

(use-package python-mode
  :ensure t
  :mode "\\.py\\'"
  :after lsp-mode
  :hook (python-mode . lsp-deferred)
  :init
  (add-hook 'python-mode-hook 'flycheck-mode)
  (setq lsp-pylsp-plugins-flake8-ignore '((
										   "D103" "D100" "E402" "E302" "E501" "C0116"
										   "C0103"))
        lsp-pylsp-server-command "~/.local/bin/pylsp"
        lsp-pylsp-plugins-flake8-max-line-length 87))

(use-package php-mode
  :ensure t
  :mode "\\.php\\'"
  :after lsp-mode
  :hook (php-mode . lsp-deferred))

(use-package lua-mode
  :ensure nil
  :hook (lua-mode . lsp-mode))

(use-package lsp-java
  :ensure t
  :hook (java-mode . lsp-deferred)
  :config
  (setq lsp-java-download-sources t
        lsp-java-content-provider-preferred "fernflower")
  :bind (:map java-mode-map
			  ("M-C-0" . lsp-treemacs-java-deps-list)))

(setq c-basic-offset 4)

(use-package c-mode
  :ensure nil
  :hook (c-mode . lsp-mode))

(use-package c++-mode
  :ensure nil
  :hook (c++-mode . lsp-mode))

(use-package company
  :ensure t
  :straight (company
			 :host github
			 :repo "nobody926/company-mode")
  :init
  (global-company-mode t)
  :config
  ;; (add-to-list 'company-backends 'company-yasnippet)
  (setq company-idle-delay 0
        company-minimum-prefix-length 2
        company-show-numbers t
        company-tooltip-limit 10
        company-tooltip-align-annotations t
		company-replace-existing nil
        company-tooltip-flip-when-above t))

(defun yas-disable-company ()
  "Disable company-mode while a yasnippet snippet is active"
  (with-conf-variable "emacsEnableCompanySnippetsLaTeX" "no"
	(when (or (equal major-mode 'latex-mode) (equal major-mode 'LaTeX-mode))
	  (company-mode -1))))

(defun yas-enable-company ()
  "Re-enable company-mode after yasnippet snippet exits"
  (with-conf-variable "emacsEnableCompanySnippetsLaTeX" "no"
	(when (or (equal major-mode 'latex-mode) (equal major-mode 'LaTeX-mode))
	  (company-mode 1))))

(add-hook 'yas-before-expand-snippet-hook #'yas-disable-company)
(add-hook 'yas-after-exit-snippet-hook #'yas-enable-company)

(defun hook/disable-company-in-org ()
  (company-mode -1))

;; (add-hook 'org-mode-hook #'hook/disable-company-in-org)

(use-package ac-php
  :ensure t
  :init
  (auto-complete-mode t)
  :config
  (require 'company-php)
  (ac-php-core-eldoc-setup)
  (setq ac-sources '(ac-source-php))
  :bind (:map global-map
              ("M-]" . ac-php-find-symbol-at-point)
              ("M-[" . ac-php-location-stack-back)))

(use-package anaconda-mode
  :ensure t
  :hook (python-mode-hook . anaconda-mode))

(use-package company-anaconda
  :ensure t
  :init (require 'rx)
  :after company
  :config
  (add-to-list 'company-backends 'company-anaconda))

(use-package company-quickhelp
  :ensure t
  :config
  (company-quickhelp-mode))

(use-package haskell-mode
  :ensure t)

(use-package company-ghci
  :ensure t
  :hook (haskell-mode-hook . company-mode))

(use-package company-web
  :ensure t
  :init
  (require 'company)
  (require 'company-web-html)
  (require 'company-css))

(use-package company-auctex
  :ensure t
  :init
  (company-auctex-init))

(use-package dap-mode
  :ensure t
  :config
  (require 'dap-php)
  (dap-php-setup)
  :bind (:map global-map
			  ("C-M-<return>" . dap-breakpoint-toggle)))

(defun open-vterm-below-project-root ()
  (interactive)
  (split-below-switch-window 1)
  (projectile-run-vterm))

(defun open-vterm-right-project-root ()
  (interactive)
  (split-right-switch-window 1)
  (projectile-run-vterm))

(defun open-vterm-below ()
  (interactive)
  (split-below-switch-window 1)
  (vterm))

(defun open-vterm-right ()
  (interactive)
  (split-right-switch-window 1)
  (vterm))

(defun vterm-run-kill (process event)
  (let ((b (process-buffer process)))
    (and (buffer-live-p b)
         (kill-buffer b))))

(defun vterm-run (command &optional buffer-name)
  (interactive
   (list
    (let* ((f (cond (buffer-file-name)))
           (filename
            (concat " " (shell-quote-argument (and f (file-relative-name f))))))
      (read-shell-command "Terminal command: "))))
  (let* ((name (if (not buffer-name)
				   (concat "*" command "*")
				 buffer-name)))
	(with-current-buffer (vterm name)
	  (set-process-sentinel vterm--process #'vterm-run-kill)
	  (vterm-send-string command)
	  (vterm-send-return))))

(defun vterm-default-keybindings ()
  (setq evil-default-state 'emacs))
