config/emacs/mine/editor-config.org
**** Define functions
Define functions for running
#+begin_src elisp
(defun run-prepare ()
  (when buffer-file-name (save-buffer))
  (split-below-switch-window))

(defun run (binary-name &optional is-only-file-name)
  "Run current file using BINARY-NAME in vterm"
  (run-prepare)
  (let* ((filename (if is-only-file-name
					   (get-only-file-name buffer-file-name)
					 buffer-file-name))
		 (formatted-filename (replace-regexp-in-string " " "\\\\ " filename)))
	(vterm-run (format "%s %s" binary-name formatted-filename))))

(defmacro defrun (function-name binary-name &optional is-only-file-name)
  "Create interactive function with (run).
WARNING: this macro creates function with prefix 'run-',
for example:
java --> run-java
php  --> run-php
"
  (declare (indent defun))
  `(defun ,(intern (concat "run-" (symbol-name function-name))) ()
     (interactive)
     (run ,binary-name ,is-only-file-name)))

(defmacro defrunc (function-name &rest body)
  "Create interactive function with (run-prepare).
WARNING: this macro creates function with prefix 'run-',
for example:
java --> run-java
php  --> run-php
"
  (declare (indent defun))
  `(defun ,(intern (concat "run-" (symbol-name function-name))) ()
     (interactive)
	 (run-prepare)
	 ,@body))
#+end_src

**** Run programming files
Macroses =(defrun)= and =(defrunc)= are very useful here
#+begin_src elisp
(defrun php "php")
(defrunc php-web (eww (concat "localhost/" (get-only-file-name buffer-file-name))))
(defrunc localhost (eww "localhost"))
(defrun python "python3")
(defrun bookmark "br")
(defrun java "java")

(defrun php-container
  "~/.config/scripts/emacs/run-php-file-container"
  (get-only-file-name buffer-file-name))

(defrun shell-script
  (replace-regexp-in-string "\^J" ""
							(shell-command-to-string
							 (format "cat %s | grep '^#!' | sed 's@.*/@@g'"
									 buffer-file-name))))
#+end_src

**** LaTeX compilation and opening
Define LaTeX compilation flags
#+begin_src elisp
(defvar LaTeX-create-output-directory t
  "The variable determines whether to create 'LaTeX-output-directory' or not")

(defvar LaTeX-compiler "pdflatex"
  "Compiler for LaTeX compilation")

(defvar LaTeX-output-directory "./.output"
  "Directory for LaTeX compilation")

(defvar LaTeX-cflags (format "-output-directory %s" LaTeX-output-directory)
  "LaTeX compilation flags")
#+end_src

Compile the document
#+begin_src elisp
(defun LaTeX-compile ()
  (interactive)
  (call-process-shell-command (concat LaTeX-compiler " "
									  LaTeX-cflags " " buffer-file-name)))

(defun LaTeX-open-log-file (filename)
  "Open log file if exists and if prompt is yes"
  (if (file-exists-p filename)
	  (when (y-or-n-p "Open log file to see errors?")
		(find-file filename))
	(message "Errors appeared, and file didn't appear")))

(defun LaTeX-compile-open ()
  "Compile LaTeX document and open the file in zathura, if exists.
Otherwise ask for input to open log file to see errors"
  (interactive)
  (unless (file-directory-p LaTeX-output-directory)
	(make-directory LaTeX-output-directory))
  (let* ((filename-base (file-name-base buffer-file-name))
		 (filename (format "%s/%s.pdf" LaTeX-output-directory filename-base))
		 (log-file (format "%s/%s.log" LaTeX-output-directory filename-base))
		 (exit-code (LaTeX-compile))
		 )
	(if (equal exit-code 0)
		(progn
		  (start-process-shell-command "zathura" nil (format "zathura %s" filename))
		  (message "%s successfully compiled" (get-only-file-name buffer-file-name))
		  )
	  (LaTeX-open-log-file log-file))))
#+end_src

**** Bind
#+begin_src elisp
(require 'python)
(require 'php-mode)
(require 'latex)

(global-set-key (kbd "S-<f9>") 'run-shell-script)

(map-bind '(("S-<f9>" . run-python)) python-mode-map)

(map-bind '(("S-<f9>"   . run-php)
			("S-M-<f9>" . run-php-container)
			("S-<f10>"  . run-php-web)) php-mode-map)

(map-bind '(("S-<f9>" . run-java)) java-mode-map)

(with-eval-after-load 'bookmark
  (map-bind '(("S-<f9>" . run-bookmark)) bookmark-mode-map))

(map-bind '(("S-<f9>" . LaTeX-compile-open)
			("S-M-<f9>" . LaTeX-compile)) LaTeX-mode-map)

(global-set-key (kbd "S-<f12>") 'run-localhost)
#+end_src

*** Main vterm config
And the plugin installation
#+begin_src elisp
(use-package vterm
  :after evil
  :ensure t
  :config
  :bind (:map global-map
    ("C-M-`" . open-vterm-below)
    ("C-M-~" . open-vterm-right)
    ("C-`" . open-vterm-below-project-root)
    ("C-~" . open-vterm-right-project-root))
  (:map vterm-mode-map
		("M-0" . treemacs)))
#+end_src

** Nyan cat mode
Nyan Mode is an analog indicator of your position in the buffer. The
Cat should go from left to right in your mode-line, as you move your
point from 0% to 100%. Activates only on april first

#+begin_src elisp
(use-package nyan-mode
  :ensure t
  :if (and (equal (nth 4 (decode-time (current-time))) 4)
           (equal (nth 3 (decode-time (current-time))) 1))
  :init
  (nyan-mode)
  (nyan-start-animation))
#+end_src

** Sudo edit
Utilities for opening files with sudo, gives us the ability to open
files with sudo privileges or switch over to editing with sudo
privileges if we initially opened the file without such privileges

#+begin_src elisp
(use-package sudo-edit
  :ensure t)
#+end_src

** Sessions saving
This program can save&load multiple named workspaces (or “workgroups”),

- Save all opened buffers, their location and sizes on disk to restore
  later
- Restore special buffers as: org-agenda, shell, magit-status, help,
  pdf-tools
- Users can set up to support any special buffer (restoring the page
  number and notes of pdf file, for example)

#+begin_src elisp
(use-package workgroups2
  :ensure t
  :config
  (setq wg-session-file "~/.config/emacs/mine/.emacs-workgroups")
  (workgroups-mode 1))
#+end_src

** Coding ligatures
Without coding ligatures everything looks not cool

#+begin_src elisp
(use-package ligature
  :ensure t
  :config
  (ligature-set-ligatures '(org-mode
                            prog-mode
                            haskell-mode
                            text-mode
                            markdown-mode
                            lsp
                            cc-mode
                            vterm-mode
							major-mode)

                          '("|||>" "<|||" "<==>" "<!--" "####" "~~>"
                            "***" "||=" "||>" ":::" "::=" "=:=" "==="
                            "==>" "=!=" "=>>" "=<<" "=/=" "!==" "!!."
                            ">=>" ">>=" ">>>" ">>-" ">->" "->>" "-->"
                            "--" "-<<" "<~~" "<~>" "<*>" "<||" "<|>"
                            "<$>" "<==" "<=>" "<=<" "<->" "<--" "<-<"
                            "<<=" "<<-" "<<<" "<+>" "</>" "###" "#_("
                            "..<" "..." "+++" "/==" "///" "_|_" "www"
                            "&&" "^=" "~~" "~@" "~=" "~>" "~-" "**"
                            "*>" "*/" "||" "|}" "|]" "|=" "|>" "|-"
                            "{|" "[|" "]#" "::" ":=" ":>" ":<" "$>"
                            "==" "=>" "!=" "!!" ">:" ">=" ">>" ">-"
                            "-~" "-|" "->" "--" "-<" "<~" "<*" "<|"
                            "<:" "<$" "<=" "<>" "<-" "<<" "<+" "</"
                            "#{" "#[" "#:" "#=" "#!"  "##" "#(" "#?"
                            "#_" "%%" ".=" ".-" ".." ".?" "+>" "++"
                            "?:" "?=" "?." "??" ";;" "/*" "/=" "/>"
                            "//" "__" "~~" "(*" "*)"
                             "\\\\" "://"))

  (global-ligature-mode t))
#+end_src

* Custom functional
:properties:
:header-args: :tangle ~/.config/emacs/mine/src/custom-functional.el
:end:

** Git sync
It commits and pushes by pressing keybindings directories which are
members of =git-sync-directories= list. Useful for org-mode directory
sync, you have full sync while using git. Here are keybindings

| Keychord  | Action                         | Command                    |
|-----------+--------------------------------+----------------------------|
| C-c S a   | Sync everything in list        | git-sync-all-list          |
| C-c S c   | Sync current directory         | git-sync-current-directory |
| C-c S P c | Update current directory       | git-pull                   |
| C-c S P a | Update all directories in list | git-pull-all-list          |

*** Config
#+begin_src elisp
(defvar git-sync-directories '("~/Org/")
  "directories for git-sync")

(defvar git-sync-keybinding-prefix "C-c S"
  "Prefix for git-sync keybindings")
#+end_src

