config/emacs/mine/src/custom-functional.el
(defvar git-sync-directories '("~/Org/")
  "directories for git-sync")

(defvar git-sync-keybinding-prefix "C-c S"
  "Prefix for git-sync keybindings")

(require 'vc-git)
