config/emacs/mine/src/plugins.el

(defun run-prepare ()
  (when buffer-file-name (save-buffer))
  (split-below-switch-window))

(defun run (binary-name &optional is-only-file-name)
  "Run current file using BINARY-NAME in vterm"
  (run-prepare)
  (let* ((filename (if is-only-file-name
					   (get-only-file-name buffer-file-name)
					 buffer-file-name))
		 (formatted-filename (replace-regexp-in-string " " "\\\\ " filename)))
	(vterm-run (format "%s %s" binary-name formatted-filename))))

(defmacro defrun (function-name binary-name &optional is-only-file-name)
  "Create interactive function with (run).
WARNING: this macro creates function with prefix 'run-',
for example:
java --> run-java
php  --> run-php
"
  (declare (indent defun))
  `(defun ,(intern (concat "run-" (symbol-name function-name))) ()
     (interactive)
     (run ,binary-name ,is-only-file-name)))

(defmacro defrunc (function-name &rest body)
  "Create interactive function with (run-prepare).
WARNING: this macro creates function with prefix 'run-',
for example:
java --> run-java
php  --> run-php
"
  (declare (indent defun))
  `(defun ,(intern (concat "run-" (symbol-name function-name))) ()
     (interactive)
	 (run-prepare)
	 ,@body))

(defrun php "php")
(defrunc php-web (eww (concat "localhost/" (get-only-file-name buffer-file-name))))
(defrunc localhost (eww "localhost"))
(defrun python "python3")
(defrun bookmark "br")
(defrun java "java")

(defrun php-container
  "~/.config/scripts/emacs/run-php-file-container"
  (get-only-file-name buffer-file-name))

(defrun shell-script
  (replace-regexp-in-string "\^J" ""
							(shell-command-to-string
							 (format "cat %s | grep '^#!' | sed 's@.*/@@g'"
									 buffer-file-name))))

(defvar LaTeX-create-output-directory t
  "The variable determines whether to create 'LaTeX-output-directory' or not")

(defvar LaTeX-compiler "pdflatex"
  "Compiler for LaTeX compilation")

(defvar LaTeX-output-directory "./.output"
  "Directory for LaTeX compilation")

(defvar LaTeX-cflags (format "-output-directory %s" LaTeX-output-directory)
  "LaTeX compilation flags")

(defun LaTeX-compile ()
  (interactive)
  (call-process-shell-command (concat LaTeX-compiler " "
									  LaTeX-cflags " " buffer-file-name)))

(defun LaTeX-open-log-file (filename)
  "Open log file if exists and if prompt is yes"
  (if (file-exists-p filename)
	  (when (y-or-n-p "Open log file to see errors?")
		(find-file filename))
	(message "Errors appeared, and file didn't appear")))

(defun LaTeX-compile-open ()
  "Compile LaTeX document and open the file in zathura, if exists.
Otherwise ask for input to open log file to see errors"
  (interactive)
  (unless (file-directory-p LaTeX-output-directory)
	(make-directory LaTeX-output-directory))
  (let* ((filename-base (file-name-base buffer-file-name))
		 (filename (format "%s/%s.pdf" LaTeX-output-directory filename-base))
		 (log-file (format "%s/%s.log" LaTeX-output-directory filename-base))
		 (exit-code (LaTeX-compile))
		 )
	(if (equal exit-code 0)
		(progn
		  (start-process-shell-command "zathura" nil (format "zathura %s" filename))
		  (message "%s successfully compiled" (get-only-file-name buffer-file-name))
		  )
	  (LaTeX-open-log-file log-file))))

(require 'python)
(require 'php-mode)
(require 'latex)

(global-set-key (kbd "S-<f9>") 'run-shell-script)

(map-bind '(("S-<f9>" . run-python)) python-mode-map)

(map-bind '(("S-<f9>"   . run-php)
			("S-M-<f9>" . run-php-container)
			("S-<f10>"  . run-php-web)) php-mode-map)

(map-bind '(("S-<f9>" . run-java)) java-mode-map)

(with-eval-after-load 'bookmark
  (map-bind '(("S-<f9>" . run-bookmark)) bookmark-mode-map))

(map-bind '(("S-<f9>" . LaTeX-compile-open)
			("S-M-<f9>" . LaTeX-compile)) LaTeX-mode-map)

(global-set-key (kbd "S-<f12>") 'run-localhost)

(use-package vterm
  :after evil
  :ensure t
  :config
  :bind (:map global-map
    ("C-M-`" . open-vterm-below)
    ("C-M-~" . open-vterm-right)
    ("C-`" . open-vterm-below-project-root)
    ("C-~" . open-vterm-right-project-root))
  (:map vterm-mode-map
		("M-0" . treemacs)))

(use-package nyan-mode
  :ensure t
  :if (and (equal (nth 4 (decode-time (current-time))) 4)
           (equal (nth 3 (decode-time (current-time))) 1))
  :init
  (nyan-mode)
  (nyan-start-animation))

(use-package sudo-edit
  :ensure t)

(use-package workgroups2
  :ensure t
  :config
  (setq wg-session-file "~/.config/emacs/mine/.emacs-workgroups")
  (workgroups-mode 1))

(use-package ligature
  :ensure t
  :config
  (ligature-set-ligatures '(org-mode
                            prog-mode
                            haskell-mode
                            text-mode
                            markdown-mode
                            lsp
                            cc-mode
                            vterm-mode
							major-mode)

                          '("|||>" "<|||" "<==>" "<!--" "####" "~~>"
                            "***" "||=" "||>" ":::" "::=" "=:=" "==="
                            "==>" "=!=" "=>>" "=<<" "=/=" "!==" "!!."
                            ">=>" ">>=" ">>>" ">>-" ">->" "->>" "-->"
                            "--" "-<<" "<~~" "<~>" "<*>" "<||" "<|>"
                            "<$>" "<==" "<=>" "<=<" "<->" "<--" "<-<"
                            "<<=" "<<-" "<<<" "<+>" "</>" "###" "#_("
                            "..<" "..." "+++" "/==" "///" "_|_" "www"
                            "&&" "^=" "~~" "~@" "~=" "~>" "~-" "**"
                            "*>" "*/" "||" "|}" "|]" "|=" "|>" "|-"
                            "{|" "[|" "]#" "::" ":=" ":>" ":<" "$>"
                            "==" "=>" "!=" "!!" ">:" ">=" ">>" ">-"
                            "-~" "-|" "->" "--" "-<" "<~" "<*" "<|"
                            "<:" "<$" "<=" "<>" "<-" "<<" "<+" "</"
                            "#{" "#[" "#:" "#=" "#!"  "##" "#(" "#?"
                            "#_" "%%" ".=" ".-" ".." ".?" "+>" "++"
                            "?:" "?=" "?." "??" ";;" "/*" "/=" "/>"
                            "//" "__" "~~" "(*" "*)"
                             "\\\\" "://"))

  (global-ligature-mode t))
