config/emacs/mine/src/custom-functional.el

(defun get-current-git-branch ()
  (vc-git--symbolic-ref (vc-git-root default-directory)))

(defun git-add (repo-directory)
  (message " adding files to commit...")
  (cd repo-directory)
  (shell-command "git add ."))

(defun git-commit ()
  (message " creating commit...")
  (let ((date (format-time-string "%d.%m.%Y"))
		(time (format-time-string "%H:%M")))
	(shell-command (format "git commit -m '%s %s'" date time))))

(defun git-push (branch repo-directory)
  (message (format " pushing %s..." repo-directory))
  (start-process-shell-command "git-sync-push" nil
							   (format "git push -u origin %s" branch)))

(defun git-pull ()
  (interactive)
  (message (format " pulling %s..." (vc-root-dir)))
  (start-process-shell-command "git-sync-pull" nil "git pull")
  (magit-refresh-all))

(defun git-sync (repo-directory branch)
  (git-add repo-directory)
  (git-commit)
  (git-push branch repo-directory)

  (message " done syncing %s" repo-directory))

(defun git-pull-all-list ()
  (interactive)

  (let ((previous-directory default-directory))
	(dolist (directory git-sync-directories)
	  (when (file-directory-p directory)
		(cd directory)
		(git-pull)))
	(cd previous-directory)))

(defun git-sync-current-directory ()
  (interactive)
  (if (get-current-git-branch)
	  (progn
		(when buffer-file-name (save-buffer))
		(when (member (vc-root-dir) git-sync-directories)
		  (git-sync (vc-root-dir) (get-current-git-branch))))
	(message "This is not a git repository")))

(defun git-sync-all-list ()
  (interactive)

  (when buffer-file-name (save-buffer))
  (let ((previous-directory default-directory))
	(dolist (directory git-sync-directories)
	  (when (file-directory-p directory)
		(message " syncing %s..." directory)
		(cd directory)
		(git-sync directory (get-current-git-branch))
		(message "------------------------------")))

	(cd previous-directory))

  (message " done syncing git-sync-directories"))

(define-minor-mode git-sync-mode
  "Toggle 'git-sync' functional on or off"
  :global t
  :interactive t
  :init-value t
  :keymap
  (list (cons (pkbd git-sync-keybinding-prefix "a") #'git-sync-all-list)
		(cons (pkbd git-sync-keybinding-prefix "c") #'git-sync-current-directory)
		(cons (pkbd git-sync-keybinding-prefix "P c") #'git-pull)
		(cons (pkbd git-sync-keybinding-prefix "P a") #'git-pull-all-list)))

(defun project-get-root ()
  (let* ((to-print (if (boundp 'current-project)
					   current-project
					 (projectile-project-root))))
	(file-name-as-directory to-print)))

(defun project-get-root ()
  (let* ((to-print (if (bound-and-true-p current-project)
                       current-project
                     (projectile-project-root))))
    (if to-print
        (file-name-as-directory to-print)
      default-directory)))

(defun project-config-get-directory ()
  (concat (project-get-root) ".emacs/"))

(defun project-config-file-get ()
  (concat (project-config-get-directory) "config.el"))

(defun project-config-file-directory-get-path (file-directory)
  "Returns path of file-directory.
Here is example how to use
(project-config-file-directory-get-path \"scripts/launcher\")"
  (concat (project-config-get-directory) file-directory))

(defvar project-config-file-no-file-message
  "Project doesn't have .emacs/config.el, create it in project root"
  "project-config-file-open and project-config-file-load show the message when
project doesn't have .emacs/config.el")

(defvar project-config-file-keybinding-prefix "C-c p f"
  "Prefix for project-config-file-* keybindings")

(defvar project-config-directory-template
  "~/.config/emacs/mine/src/resources/.emacs"
  "Template directory for project config. The template should have that structure
.emacs
├── config.el
└── snippets
    ├── conf-space-mode
    │   ├── bookmark-all
    │   ├── bookmark-base
    │   └── bookmark-include
    └── php-mode
        ├── array-in
        ├── array-not-in
        └── array-push

snippets/ directory is like your yasnippet directory, therefore it
should have structure with modes like in that example that i have shown
")

(defun project-config-file-create ()
  "Copy directory from project-config-directory-template to project root"
  (interactive)
  (copy-directory project-config-directory-template (project-get-root))
  (message "%s has been created" (project-config-file-get)))

(defun project-config-file-open ()
  "Open project-config-file which gets from project-config-file-get and the file
is located in (project-config-get-directory)/config.el"
  (interactive)
  (let ((project-config-file (project-config-file-get)))
	(if (file-exists-p project-config-file)
		(find-file project-config-file)
	  (message project-config-file-no-file-message))))

(defun project-config-directory-delete (project-config-directory)
  "Delete project config"
  (when (y-or-n-p "Are you sure you want to delete project config?")
	(delete-directory project-config-directory "recursive")))

(defun project-config-directory-find-delete ()
  "Find project config directory and delete"
  (interactive)
  (let ((project-config-directory (project-config-get-directory)))
	(if (file-directory-p project-config-directory)
		(project-config-directory-delete project-config-directory)
	  (message project-config-file-no-file-message))))

(require 'projectile)

(defun project-config-file-load (project-config-file)
  "Load project config file"
  (message "Loading project config from %s" project-config-file)
  (load-file project-config-file))

(defun project-config-file-find-load ()
  "Find project config file and load"
  (interactive)
  
  (let ((project-config-file (project-config-file-get)))
	(if (file-exists-p project-config-file)
		(project-config-file-load project-config-file)
	  (message project-config-file-no-file-message))))

(define-minor-mode project-config-mode
  "Toggle 'project-config-mode' functional on or off"
  :global t
  :interactive t
  :init-value t
  :keymap
  (list
   (cons (pkbd project-config-file-keybinding-prefix "c") #'project-config-file-create)
   (cons (pkbd project-config-file-keybinding-prefix "o") #'project-config-file-open)
   (cons (pkbd project-config-file-keybinding-prefix "d") #'project-config-directory-find-delete)
   (cons (pkbd project-config-file-keybinding-prefix "l") #'project-config-file-find-load)
   ))

(defun enable-reader-mode ()
  (when (y-or-n-p "Enable gruvbox theme?")
	(disable-ewal "reader"))

  (setq truncate-lines nil)
  (display-line-numbers-mode 0) 
  (hl-line-mode t)

  (message "reader-mode enabled"))

(defun disable-reader-mode ()
  (message "reader-mode disabled")

  (if-conf-variable "colorscheme" "pywal"
	(enable-ewal)
	(disable-ewal))

  (setq truncate-lines t)
  (display-line-numbers-mode t) 
  (hl-line-mode 0))
