config/emacs/mine/editor-config.org
*** Main function
#+begin_src elisp
(define-minor-mode reader-mode
  "Toggle 'reader-mode' functional on or off"
  :interactive t
  :init-value nil
  (if (derived-mode-p 'org-mode)
	 (if reader-mode
		 (enable-reader-mode)
	   (disable-reader-mode))
	(progn
	  (setq reader-mode nil)
	  (message "You can use this minor-mode only in org-mode"))))

(define-key org-mode-map (kbd "C-c r") 'reader-mode)
#+end_src

** Open bookmarks
This should use =files= bookmark file from =$bookmarksPath= or
=$standardBookmarksPath=

#+begin_src elisp
(defvar open-bookmark-file "~/Documents/bookmarks/emacs.dmenu-ignore"
  "Bookmark file to open bookmark")

(defun read-bookmark-file ()
  "Run 'br' on bookmark file"
  (let* ((file open-bookmark-file)
		 (command (concat "br " open-bookmark-file)))
	(if (file-exists-p open-bookmark-file)
		(replace-regexp-in-string "'" ""
								  (replace-regexp-in-string
								   "\\\\ " " "
								   (source-shell-script-run-command
									"~/.config/scripts/functions.sh" command)))
	  nil)))

(defun open-bookmark ()
  "Open selected file from (read-bookmark-file)"
  (interactive)
  (let* ((bookmark-file-contents (read-bookmark-file))
		 (bookmark (if (not bookmark-file-contents)
					   (error "Bookmark file: %s doesn't exist" open-bookmark-file)
					 (ivy-read "Choose bookmark to open: "
							   (split-string bookmark-file-contents "\n"))))
		 (file (remove-prefix-to-first-space bookmark)))
	(when file
	  (find-file file))))

(define-key evil-normal-state-map (kbd "<leader>Bo") 'open-bookmark)
#+end_src

** Bookmark major-mode
#+begin_src elisp
(defvar bookmark-mode-syntax-table
  (let ((st (make-syntax-table)))
    (modify-syntax-entry ?# "<" st)
    (modify-syntax-entry ?\n ">" st)
    st)
  "Syntax table for 'bookmark-mode'")

(defvar bookmark-indent-offset 18
  "Indentation offset for 'bookmark-mode'")

(defvar bookmark-align-column 18
  "Column at which the second column should start in 'bookmark-mode'")

(defun bookmark-align-line ()
  "Align current line so the second column starts at 'bookmark-align-column'"
  (interactive)
  (save-excursion
    (beginning-of-line)
    (when (re-search-forward "^\\(\\S-+\\)\\s-*" (line-end-position) t)
      (let* ((key (match-string 1))
             (padding (max 1 (- bookmark-align-column (length key))))
             (spaces (make-string padding ?\s)))
        (replace-match (concat key spaces) t t)))))

(define-derived-mode bookmark-mode fundamental-mode "bookmark"
  "A major mode for editing Bookmark files"
  :syntax-table bookmark-mode-syntax-table
  (setq-local font-lock-defaults '((bookmark-font-lock-keywords))
			  comment-start "#"
              comment-end ""
			  tab-width bookmark-indent-offset
              indent-line-function #'bookmark-align-line)
  (define-key bookmark-mode-map (kbd "TAB") #'bookmark-align-line))

(defvar bookmark-font-lock-keywords
  '(("TODO:" . font-lock-warning-face)
    ("\\<\\(FIXME\\|BUG\\):" 1 font-lock-warning-face t)
	("^!.*:" . font-lock-keyword-face)
	)
  "Highlighting expressions for `bookmark-mode'")

(add-to-list 'auto-mode-alist '("\\.bookmark\\'" . bookmark-mode))
#+end_src

** Org-mode discipline
*** Variables
#+begin_src elisp
(defvar org-discipline-xp-storage-file "~/.config/emacs/mine/.org-xp"
  "Org-discipline storage for xp")

(defvar org-discipline-prefix "M-o D"
  "Org-discipline keybindings prefix")

(defvar org-discipline-xp-sum 60
  "Current amount of XP the user has accumulated")

(defvar org-discipline-required-starting-xp 100
  "Base amount of 'XP' required to level up in the discipline system.
This value may increase with each level by 'org-discipline-xp-sum'")

(defvar org-discipline-level 0
  "Level in org-discipline. It automatically will be determined
according to xp in 'org-discipline-xp-storage-file'")
#+end_src

*** Getters
Get saved xp from file
#+begin_src elisp
(defun org-discipline-get-level (xp &optional do-print-information)
  "Get level according to 'XP'. Print information if
'DO-PRINT-INFORMATION' is not nil"
  (let ((level 0)
		(required org-discipline-required-starting-xp))
	(while (>= xp required)
	  (setq level (+ level 1)
			required (+ required org-discipline-xp-sum)
			xp (- xp org-discipline-xp-sum)))
	(if do-print-information
		(message " level: %d,  xp: %d,  required xp for new level: %d"
				 level xp required)
	  level)))

(defun org-discipline-get-stored-xp ()
  "Get xp from 'org-discipline-xp-storage-file' file location.
If file doesn't exist, create it and write 0 to the file"
  (interactive)
  (unless (file-exists-p org-discipline-xp-storage-file)
	(with-temp-buffer
	  (insert "0")
	  (write-region (point-min) (point-max) org-discipline-xp-storage-file)))
  (let ((xp (string-to-number (read-file org-discipline-xp-storage-file))))
	(if (called-interactively-p)
		(org-discipline-get-level xp t)
	  xp)))
#+end_src

Get skipped days in order to determine how much xp should be
substracted
#+begin_src elisp
(defun org-discipline-get-skipped-days ()
  "Substract current date and 'SCHEDULED'"
  (interactive)
  (let ((scheduled (org-get-scheduled-time nil)))
    (if scheduled
        (let* ((now (current-time))
               (days (floor (/
							 (float-time (time-subtract now scheduled)) 86400))))
		  (when (called-interactively-p)
			(if (< days 0)
				(message "Days until the task: %d" (* days -1))
			  (message "Skipped days: %d" days)))
		  days)
	  (when (called-interactively-p)
		(error "No SCHEDULED timestamp found"))
      0)))

(define-key org-mode-map (kbd "M-o g s") 'org-discipline-get-skipped-days)
#+end_src

Get xp amount according to task difficulty in order to sum current
xp or if task is skipped, substract by percentage according to
difficulty
#+begin_src elisp
(defun org-discipline-get-difficulty-xp (difficulty)
  "Get xp amount according to 'DIFFICULTY'"
  (pcase (downcase difficulty)
	("easy"   5)
	("medium" 10)
	("hard"   15)))

(defun org-discipline-get-difficulty-xp-loss-percentage (difficulty days-skipped)
  "Get xp loss percentage amount according to 'DIFFICULTY'"
  (if (> days-skipped 0)
	  (pcase (downcase difficulty)
		("easy"   0.3)
		("medium" 0.2)
		("hard"   0.1))
	0))

(defun org-discipline-get-skipped-days-xp-loss-percentage (days-skipped)
  "Get xp loss percentage amount according to skipped days.
Skipped days have formula: current date - scheduled"
  (cond
   ((>= days-skipped 10) 0.3)
   ((>= days-skipped 5) 0.2)
   ((>= days-skipped 2) 0.1)
   (t 0)))
#+end_src

*** Calculate
#+begin_src elisp
(defun org-discipline-calculate ()
  "Sum stored stored xp according to ':DIFFICULTY' header property,
then write to 'org-discipline-xp-storage-file' file. Depending on
difficulty and days skipped count, you will lose xp and the easier
task the more xp you will lose. And the longer you skipped the
task, the more xp you will lose"
  (let* ((xp (org-discipline-get-stored-xp))
		 (difficulty (org-entry-get nil "DIFFICULTY" t))
		 (profit (org-discipline-get-difficulty-xp difficulty))
		 (skipped-days (org-discipline-get-skipped-days))
		 (loss-skipped (org-discipline-get-skipped-days-xp-loss-percentage
						skipped-days))
		 (loss-difficulty (org-discipline-get-difficulty-xp-loss-percentage
						   difficulty skipped-days))
		 (loss (+ loss-difficulty loss-skipped)))
	(if (> loss 0)
		(- xp (* xp loss))
	  (+ xp profit))))
#+end_src

*** Write changes to file
#+begin_src elisp
(defun org-discipline-calculate-write-to-file ()
  "Calculate and redirect result to 'org-discipline-xp-storage-file'"
  (let ((calculated-xp (org-discipline-calculate)))
	(with-temp-file org-discipline-xp-storage-file
	  (insert (number-to-string calculated-xp)))))
#+end_src

*** Hook function
#+begin_src elisp
(defun org-discipline-calculation-on-todo-write-file ()
  "Calculate xp according to ':DIFFICULTY' and skipped days.
If loss >= 0, xp from 'org-discipline-xp-storage-file' will be
substracted by summary loss percentage of xp. Otherwise, you will
get profit"
  (when (and (equal org-state "DONE") (org-entry-get nil "DIFFICULTY" t))
	(org-discipline-calculate-write-to-file)
	;; Dumb shit, but i don't know how to print it after "Entry repeats: ..."
	(run-at-time 0.01 nil
				(lambda ()
				(call-interactively 'org-discipline-get-stored-xp)))))
#+end_src

