config/emacs/mine/editor-config.org
*** Define minor-mode
#+begin_src elisp
(define-minor-mode org-discipline-mode
  "Toggle 'org-discipline-mode' functional on or off"
  :global t
  :interactive t
  :keymap
  (list
   (cons (pkbd org-discipline-prefix "m") #'org-discipline-get-stored-xp)
   (cons (pkbd org-discipline-prefix "S") #'org-discipline-get-skipped-days)
   )

  (let ((target-hook 'org-after-todo-state-change-hook)
		(function 'org-discipline-calculation-on-todo-write-file))
	(if (eq org-discipline-mode nil)
		(remove-hook target-hook function)
	  (add-hook target-hook function t))
	)
  )
#+end_src
